import random
import os
import time
import hashlib

###############   СЛОВАРИ   ###############
a1m = {
    'зис 101': 'ЗиС-101А Спорт',
    'газ 13': 'ГАЗ-13 Чайка',
    'форд фалкон': 'Ford Falcon XB PS',
    'додж вайпер': 'Dodge Viper SRT',
    'лотус': 'Lotus Evija',
    'комаро сс': 'Chevrolet Camaro SS VI',
    'комаро 1': 'Chevrolet Camaro I',
    'альфа ромео': 'Alfa Romeo Giulia',
    'хипхи': 'HiPhi Z',
    'импалу': 'Impala SS Hardtop',
    'прадик': 'TLC Prado AT',
    'ролс ройс гост': 'R-R Ghost Limousine',
    'пижо 406': 'Peugeot 406 Truck',
    'багги бандито': 'Багги Bandito',
    'хонда нс икс': 'Honda NSX NA1',
    'сузуки джими': 'Suzuki Jimny JB74',
    'сильвию 13': 'Nissan Silvia S13',
    'сильвию 14': 'Nissan Silvia S14',
    '21099': 'ВАЗ-21099',
    'ларгус': 'LADA Largus Cross',
    'субару легаси': 'Subaru Legacy BC',
    'зазик А': 'ЗАЗ-968А',
    'зазик М': 'ЗАЗ-968М',
    'гольфкар': 'Гольф-кар',
    'кию рио': 'Kia Rio',
    'х5м компетишн': 'BMW X5М Competition',
    'х5м': 'BMW X5М',
    'х7': 'BMW X7 G07',
    'х5 53': 'BMW X5 E53',
    'бмв ай 8': 'BMW i8',
    'ф92': 'BMW М8 F92',
    'ф93': 'BMW М8 F93',
    'М шестую': 'BMW M6 F13',
    'е39': 'BMW M5 E39',
    'е34': 'BMW M5 E34',
    'е60': 'BMW M5 E60',
    'ф10': 'BMW M5 F10',
    'ф90': 'BMW M5 F90',
    'г90': 'BMW M5 G90',
    'ф82': 'BMW M4 F82',
    'г83': 'BMW M4 G83 xDrive',
    'г82': 'BMW M4 G82',
    'е30': 'BMW M3 E30 Cabrio',
    'октавию мк3': 'Skoda octavia mk3',
    'е46': 'BMW M3 E46',
    'е92': 'BMW M3 E92',
    'ф87': 'BMW M2 F87',
    'е92': 'BMW M3 E92',
    'бумер': 'BMW 750iL E38',
    'е36': 'BMW M3 E36',
    'фиат абарт': 'Fiat 500 Abarth',
    'кабана': 'MB S600 W140',
    'мерс в124': 'MB E500 W124',
    'банан': 'MB CLS 400 4-Matic',
    'в219': 'MB CLS w219',
    'спринтера': 'MB Sprinter',
    'е55': 'MB E55 AMG W210',
    'икс290': 'MB AMG GT S X290',
    'мерс акулу': 'MB AMG GT 4-DС',
    'в222': 'MB S650 W222',
    'гелик 463': 'MB G65 W463',
    'уазик 469': 'УАЗ-469 Stalker',
    'мерс 190е': 'MB 190е w201 Evo II',
    'гелик 464': 'MB G63 W464',
    'гелик 4 на 4': 'MB G63 4х4',
    'ешку 212': 'MB E63 W212',
    'ешку 213': 'MB E63s W213',
    'цешку 205': 'MB C63 W205',
    'GLE амг': 'MB GLE63s AMG',
    'AVTR': 'MB AVTR',
    'мерседес гтр': 'MB AMG GTR',
    'в223': 'MB S450 W223',
    'ГЛС 600': 'M-M GLS 600',
    'X класс': 'MB X-Class W470',
    'V класс': 'MB V-Class W447',
    'уаз патриот': 'УАЗ Patriot',
    'уаз 3303': 'УАЗ 3303',
    'газ 3110': 'ГАЗ-3110',
    'ренж ровер': 'Range Rover',
    'цивик ек9': 'Honda Civic Type-R EK9',
    'хонду 2000': 'Honda S2000',
    'цивик фк8': 'Honda Civic Type-R FK8',
    'краун': 'Toyota Crown',
    'октавию': 'Skoda Octavia',
    'копейку': 'ВАЗ-2101',
    '2102': 'ВАЗ-2102',
    'четвёрку': 'ВАЗ-2104',
    'пятёрку': 'ВАЗ-2105',
    'шестёрку': 'ВАЗ-2106',
    'семёрку': 'ВАЗ-2107',
    'восьмёрку': 'ВАЗ-2108',
    'девятку': 'ВАЗ-2109',
    'десятку': 'ВАЗ-2110',
    'двенашку': 'ВАЗ-2112',
    'тринашку': 'ВАЗ-2113',
    'четырку': 'ВАЗ-2114',
    'оку': 'ВАЗ-1111 Ока',
    'приору': 'Lada Priora',
    'гранту': 'Lada Granta',
    'весту': 'Lada Vesta',
    'весту св': 'Lada Vesta SW',
    'ладу 4х4': 'Lada 4x4',
    'ауди р8': 'Audi R8 2G',
    'рс6 ц7': 'Audi RS6 C7',
    'рс6 ц8': 'Audi RS6 C8',
    'шевроле монстр': 'Ch. Monster',
    'корвет ц3': 'Ch. Corvette C3',
    'корвет ц7': 'Ch. Corvette C7',
    'корвет ц8': 'Ch. Corvette ZR1 C8',
    'рс7 ц8': 'Audi RS7 C8',
    'ауди с3': 'Audi S3 Sedan',
    'ауди тт': 'Audi TT',
    'супру 90': 'Toyota Supra A90',
    'супру 80': 'Toyota Supra A80',
    'труено': 'Toyota Trueno AE86',
    'марк 2': 'Toyota Mark II X100',
    'камри 50': 'Toyota Camry XV50',
    'камри 70': 'Toyota Camry XV70',
    'чейзера': 'Toyota Chaser',
    'крузак 200': 'Toyota Land Cruiser 200',
    'крузак 300': 'Toyota Land Cruiser 300',
    'тоёту alphard': 'Toyota Alphard',
    'тоёту гт86': 'Toyota GT86',
    'рено логан': 'Renault Logan',
    'Л560': 'LR RR Velar L560',
    'ренж ровер СВА': 'LR RR SVA',
    'фольксваген гольф': 'Volkswagen Golf MKI',
    'фольксваген Buzz': 'Volkswagen ID. Buzz',
    'мультивен': 'Volkswagen Multivan',
    'мазду рх8': 'Mazda RX-8',
    'мазду рх7': 'Mazda RX-7',
    'сенну': 'McLaren Senna',
    'маверик х3': 'Can-Am Meverick X3',
    'дмс 12': 'DeLorean DMC-12',
    'ниссан ГТР 35': 'Nissan GT-R R35',
    'ниссан гтр 34': 'Nissan SkyLine GT-R 34',
    'ниссан гтр 33': 'Nissan SkyLine GT-R 33',
    'ниссан гтр 32': 'Nissan SkyLine GT-R 32',
    'фэирледи 240': 'Nissan Fairlady 240z',
    'сильвию 15': 'Nissan Silvia S15',
    'ниссан титан': 'Nissan Titan',
    'ниссан 370': 'Nissan 370z',
    'форд фокус': 'Ford Focus',
    'форд Б': 'Ford Model B',
    'форд раптор': 'Ford F-150 Raptor',
    'форд мустанг': 'Ford Mustang GT',
    'квадру': 'Quadra V-Tech',
    'форд Хот Род': 'Ford Hot-Road',
    'додж рам': 'Dodge RAM 1500 Rebel TRX',
    'чарджер СРТ': 'Dodge Charger SRT',
    'чарджер СРТ хеллкат': 'Dodge Charger SRT Hellcat',
    'челленджер РТ': 'Dodge Challenger R/T',
    'континенталь': 'Bentley Continental',
    'бентьягу': 'Bentley Bentyaga',
    'джип гладиатор': 'Jeep Gladiator',
    'джип чироки': 'Jeep Grand Cherokee',
    'хаммер ЕВ': 'Hummer EV',
    'хаммер аш 1': 'Hummer H1',
    'чирон': 'Bugatti Chiron',
    'буггати еб110': 'Bugatti EB110',
    'инфинити 50': 'Infiniti Q50',
    'фланкер Ф': 'Flanker F',
    'Эскалейд': 'Cadillac Escalade',
    'кадиллак 1949': 'Cadillac Deville 1949',
    'GMC вандуру': 'GMC Vandura',
    'импрезу WRX STI': 'Subaru Impreza WRX STI',
    'импрезу WRX STI GD': 'Subaru Impreza WRX STI GD',
    'импрезу WRX STI GR': 'Subaru Impreza WRX STI GR',
    'урус': 'Lamborghini Urus',
    'хуракан': 'Lamborghini Huracan',
    'авентадор': 'Lamborghini Aventador',
    'ягуар': 'Jaguar F-Type',
    'порш панамеру': 'Porsche Panamera',
    'порш каен': 'Porsche Cayenne',
    'порш каен купе': 'Porsche Cayenne Coupe',
    '911 1': 'Porsche 911 (991)',
    '911 гт3': 'Porsche 911 GT3 (992)',
    '911 2': 'Porsche 911 (992)',
    'порш тайкан': 'Porsche Taycan',
    'газ 66': 'ГАЗ-66',
    'феррари 458': 'Ferarri 458 Italia',
    'феррари лукко': 'Ferarri GTC4Lucco',
    'панелван': 'Holden Sandman HQ Panelvan',
    'военный камаз 43118': 'Венный КамАЗ-43118',
    'КаВЗ 685': 'КаВЗ-685',
    'Газ 24': 'ГАЗ-24 Кабриолет',
    'лансер 9': 'Mitsubishi Lancer Evo IX',
    'лансер 10': 'Mitsubishi Lancer Evo X',
    'ролс кулинан': 'R-R Culinan',
    'ролс фантом': 'R-R Phantom',
    'лексус ИСФ': 'Lexus IS-F',
    'лексус лх570': 'Lexus LX570 URJ201',
    'лексус лк500': 'Lexus LC500 URZ100',
    'лексус лх600': 'Lexus LX600',
    'лексус рх350': 'Lexus RX350',
    'лексус ис 350': 'Lexus IS 350',
    'лексус ис 300': 'Lexus IS300',
    'лексус 750': 'Lexus 750',
    'кибертрак': 'Tesla CyberTruck',
    'теслу ЭС': 'Tesla Model S',
    'ролс даун': 'Rolls-Royce Dawn',
    'зил 130': 'Зил - 130',
    'феррари ф12': 'Ferrari F12tdf',
    'феррари ф40': 'Ferrari F40',
    'феррари ф488 гтб': 'Ferrari F488 GTB',
    'феррари ф8 трибуто': 'Ferrari F8 Tributo',
    'бентли ультратанк': 'Bentley Ultratank',
    'мазерати леванте': 'Maserati Levante',
    'паджерик': 'Mitsubishi Pajero V80',
    'ниссан пульсар': 'Nissan Pulsar GTI-R',
    'ниссан 240сх': 'Nissan 240SX',
    'теслу С плэйд': 'Tesla Model S Plaid',
    'вольво 670': 'Volvo VNL670',
    'урал': 'Урал-4320 Next',
    'фольксваген мк8': 'Volkswagen Golf MK8 GTI',
    'поло лифтбек': 'Volkswagen Polo Liftback',
    'аурус сенат': 'Aurus Senat',
    'аурус сенат конвертэбл': 'Aurus Senat Convertible',
    'миникупер': 'MINI John Cooper Works GP',
    'фольксваген т6': 'Volkswagen Transporter T6',
    'ниву трэвел': 'Lada Niva Travel',
    'г81 туринг': 'BMW M3 Touring G81',
    'бмв 2002 турбо': 'BMW 2002 Turbo',
    'мерс 580': 'Mercedes-Benz EQS 580',
    'ауди рс4': 'Audi RS4 (B5)',
    'газ м20': 'ГАЗ М-20',
    'мустанг хуник': 'Ford Mustang Hoonicorn',
    'ку 8': 'Audi RS Q8',
    'фольксваген т6': 'Volkswagen Transporter T6',
    'ф80': 'BMW M3 F80',
    'фэирледи рз34': 'Nissan Fairlady Z RZ34',
    'Уаз сгр': 'УАЗ СГР',
    'хёндай 74': 'Hyundai N Vision 74',
    'буханку 2077': 'Буханка 2077',
    'цешку 204 амг': 'MB C-class W204 AMG',
    'ктм': 'KTM X-Bow',
    'х6м ф96': 'BMW X6M Competition F96',
    'додж челленджер демон': 'Dodge Challenger SRT Demon',
    'порш 911 930': 'Porsche 911 (930)',
    'г80': 'BMW M3 G80',
    'форд гт40': 'Ford GT40',
    'сален с7': 'Saleen S7',
    'ваз 2329': 'ВАЗ-2329',
    'форд мустанг гт500': 'Ford Mustang Shelby GT500',
    'матиз': 'Daewoo Matiz M150',
    'прото': 'Proto Speedster',
    'лисян л9': 'LiXiang L9',
}

m1m = {
    'яву': 'Ява',
    'ямаху мт10': 'Yamaha MT10',
}

moto = {
     'дукати рр': 'Ducati Desmodesici RR',
     'ктм 350': 'KTM 350 EXC-F',
     'дукати эс': 'Ducati XDiavel S',
     'бмв эс1000рр': 'BMW S1000RR',
     'ктм 1290': 'KTM 1290 Super Duke R',
}

skins = ['Мастер кунг-фу', 'Снежный эльф', 'Девушка в персиковом', 'Дора', 'Футболка One', 'Сутенёр',
        'Конор МакГрегор', 'Хасбик', 'Гангстер с татуировками', 'Девушка в парандже', 'Маленький мальчик', 'Рубашка на поясе',
        'Маленькая девочка', 'Мейби Бейби', 'Белый шейх', 'Близняшка', 'Cyberpunk', 'Мияги', 
        'Pyrex', 'Якудза', 'Бомж', 'Бомж с табличкой', 'Байкер', 'Девон Аоки',
        'Хабиб', 'Черный опер', 'Красный опер', 'Бабушка', 'Навальный', 'Жириновский',
        'Биг Смоук', 'Биг Смоук в бронежилете', 'Бизнес леди', 'Gawr Gura', 'Федя Чу', 'Джон Уик',
        'Администратор', 'Девушка в хиджабе', 'Дед Мороз', '2В', 'Джо Барбаро', 'Ведьма',
        'Кощей', 'Элвис', 'Белый Элвис', 'Синий Элвис', 'Давидыч', 'Томас Шелби',
        'Рейдерша', 'Ву Зи Му', 'Лапенко', 'Снегурочка', 'Правительство', 'Моргенштерн',
        'Фермер', 'Сергей Бодров', 'Нурлан Сабуров', 'Чертяка с тыквой', 'Лукашенко', 'Петух',
        'Шоколадка', 'Deadpool', 'Макима', 'Маска', 'Тыквенная леди', 'Жекич Дубровский',
        'Парикмахер', 'Скуф', 'Гонщик Стиг', 'Паша Техник', 'Дин Винчестер', 'Covid-19',
        'Монашка', 'Косплей монашки', 'Рыбак', 'Уличный', 'Наркобарон', 'Ученица-маг',
        'Alt Girl', 'Демон', 'Мотоциклистка', 'Девушка (Сталкер)', 'Тактический сталкер', 'Гокудо',
        'Триада', 'Девушка в пижаме', 'Теннисистка', 'Илон Маск', 'Уэнсдей', 'Школьница',
        'Шинобу', 'Пляжник', 'Пляжница', 'Девушка в полосатом', 'Кромешник', 'Светящийся костюм',
        'Скелет', 'Костюм единорожки', 'Спектра', 'Горк',
        ]

UnchangeableSeeking = {
    'ищу лицензера': '[Поиск] Ищу опытного лицензера. Просьба связаться.',
    'ищу адвоката': '[Поиск] Ищу опытного адвоката. Просьба связаться.',
    'ищу прокурора': '[Поиск] Ищу опытного прокурора. Просьба связаться.',
    'ищу терапевта': '[Поиск] Ищу опытного терапевта. Просьба связаться.',
    'ищу нарколога': '[Поиск] Ищу опытного нарколога. Просьба связаться.',
    'ищу психолога': '[Поиск] Ищу опытного психолога. Просьба связаться.',
    'ищу хирурга': '[Поиск] Ищу опытного хирурга. Просьба связаться.',
    'ищу водилу бензовоза': '[Поиск] Ищу опытного водителя бензовоза. Просьба связаться.',
    'ищу развозчика товаров': '[Поиск] Ищу опытного развозчика товаров. Просьба связаться.',
    'ищу механика': '[Поиск] Ищу опытного механика. Просьба связаться.',
    'ищу парня': '[Поиск] Ищу парня для с/о. О себе: при встрече. Просьба связаться.',
    'ищу девушку': '[Поиск] Ищу девушку для с/о. О себе: при встрече. Просьба связаться.',
    'ищу знакомства': '[Поиск] Ищу новые знакомства. О себе: при встрече. Просьба связаться.',
    'ищу игрока в казик': '[Поиск] Ищу азартного игрока в казино. Просьба связаться.',
    'ищу игрока в кости': '[Поиск] Ищу азартного игрока в кости. Просьба связаться.',
    'ищу игрока в комп клуб': '[Поиск] Ищу игрока в компьютерный клуб. Просьба связаться.',
    'ищу игрока в орла и решку': '[Поиск] Ищу азартного игрока в "Орёл и решка". Просьба связаться.',
    'ищу игрока в Хай-дайс': '[Поиск] Ищу азартного игрока в "Хай-дайс". Просьба связаться.',
    'ищу дальних родственников': '[Поиск] Ищу дальних родственников. Просьба связаться.',
}

things = {
    'стероиды': 'Стероиды',
    'шпалеры': 'Шпалера',
    'стимуляторы': 'Стимулятор',
    'пружины': 'Пружины',
    'большие аптечки': 'Большая аптечка',
    'адрик S': 'Адреналин-S',
    'золотую рулетку': 'Золотая рулетка',
    'мп коины': 'МП COIN',
    'амаз коины': 'AMZ COIN',
    'ведро с эмульсией': 'Ведро с эмульсией',
    'ведро с эмульсией ультра': 'Ведро с эмульсией Ultra',
    'мультитулы': 'MultiTools',
    'крестик ручной работы': 'Крестик ручной работы',
    'чётки': 'Чётки перекидные',
    'мусорное ведро': 'Мусорное ведро',
    'ведро': 'Ведро',
}

blueprints = {
    'абакан': 'АН-94 Абакан',
    'дигл': 'Desert Eagle',
    'оц 14 Гроза': 'ОЦ-14 Гроза',
    'тек 9': 'ТЕС-9',
    'свд псо': 'СВД-ПСО',
    'страйкер': 'Striker-12',
    'вал': 'АС Вал',
    'глок': 'Glock-18',
    'скс': 'CKC',
    'м4а4': 'М4А4',
    'снятие номеров': 'Снятие номеров',
    'починку инструмента': 'Починка инструмента',
    'снятие неона': 'Снятие неона',
    'снятие рамки номеров': 'Снятие номерной рамки',
    'смену цвета фар': 'Смена оттенка фар',
    'безопасное улучшение акса': 'Безопасное улучшение аксессуара',
    'усиленное улучшение акса': 'Усиленное улучшение аксессуара',
    'улучшение акса': 'Улучшение аксессуара',
    'чертеж ящика с матами': 'Ящик с материалами',
    'чертеж ящикк с консервами': 'Ящик с консервами',
    'чертёж большой аптеки': 'Большая аптечка',
    'чертеж армейской аптеки': 'Армейская аптечка',
    'чертеж адрика': 'Адреналин',
    'наган': 'Наган',
}

SeparatelyTuning = {
    'доп багажник': 'дополнительный багажник для автомобиля',
    'град покраску': 'градиентовую покраску для автомобиля',
    'доп бак': 'дополнительный бак для автомобиля',
    'неон градик': 'неоновую подсветку "Градиент" на автомобиль',
    'неон радугу': 'неоновую подсветку "Радуга" на автомобиль',
    'неон статик': 'неоновую подсветку "Статичная" на автомобиль',
    'ст1': 'элемент тюнинга "Stage 1" для автомобиля',
    'ст2': 'элемент тюнинга "Stage 2" для автомобиля',
    'ст3': 'элемент тюнинга "Stage 3" для автомобиля',
    'пневму': 'пневмоподвеску для автомобиля',
    'страбы': 'стробоскопы на автомобиль',
    'закись азота': 'закись азота для автомобиля',
    'гидравлику': 'гидроподвеску для автомобиля',
    'цветную рамку': 'цветные рамки под г/н',
    'брендовые рамку': 'брендовые рамки под г/н',
}

PlacesForHouse = {
    'в батке': 'в пгт. Батырево',
    'в области': 'в Нижегородской области',
    'у ЦР': 'у Центрального рынка',
    'в эдовке': 'в пос. Малая Эдовка',
    'в Гарели': 'в д. Гарель',
    'в бусаево': 'в пос. Бусаево',
    'в роговичах': 'в с. Роговичи',
    'в Рыжевске': 'в пгт. Рыжевск',
    'в карьерном': 'в пос. Карьерный',
}

services = {
    'предлагаем услуги лицензера': '[Разное] Область предлагает услуги лицензера. Желающим просьба связаться.',
    'предлагаем услуги адвоката': '[Разное] Область предлагает услуги адвоката. Желающим просьба связаться.',
    'предлагаем услуги прокурора': '[Разное] Область предлагает услуги прокурора. Желающим просьба связаться.',
    'предлагаем услуги терапевта': '[Разное] Клиника предоставляет услуги терапевта. Желающим просьба связаться.',
    'предлагаем услуги нарколога': '[Разное] Клиника предоставляет услуги нарколога. Желающим просьба связаться.',
    'предлагаем услуги психолога': '[Разное] Клиника предоставляет услуги психолога. Желающим просьба связаться.',
    'предлагаем услуги хирурга': '[Разное] Клиника предоставляет услуги хирурга. Желающим просьба связаться.',
    'предлагаем услуги механика': '[Разное] По области работает опытный механик. Желающим просьба связаться.',
    'предлагаем услуги водилы бензовоза': '[Разное] По области работает опытный водитель бензовоза. Желающим просьба связаться.',
    'предлагаем услуги развозчика товаров': '[Разное] По области работает опытный водитель товаров. Желающим просьба связаться.',
    'сниму номера в Вашего авто': '[Разное] Сниму гос. номера с Вашего автомобиля. Просьба связаться.',
    'сдаю комнату в коттедже': '[Разное] Опытный арендодатель сдаст комнату в коттедже. Просьба связаться.',
    'сниму комнату в коттедже': '[Разное] Сниму комнату в коттедже. Просьба связаться.',
    'сниму комнату в доме': '[Разное] Сниму комнату в доме. Просьба связаться.',
}

seeds = [
    'Кукурузы', 'Картофель', 'Тыквы', 'Перца', 'Лук репчатый', 'Арбуза', 'Баклажаны', 'Помидора', 'Чеснок', 'Морковь'
]

genoms = [
    'GGG-GGG', 'XXY-YYY', 'YYY-YYY'
    ]

aks = ['Колос пшеницы', 'RGB рюкзак', 'Голубые крылья', 'Шеврон звезда СССР', 'RGB наушники', 
       'Кожаный рюкзак', 'Новогодний GIF рюкзак', 'Маска Они', 'Ушанка черная', 'Ушанка розовая', 
       'Бронзовый кейс', 'Ушанка', 'Сигара', 'Плюшевый Осьминог', 'Черная женская шляпа', 
       'Эльфийский венок', 'Бронежилет', 'Пиксельный бронежилет', 'Бронежилет карателя', 'Бронежилет сталкера', 
       'Крылья феи', 'Катана Cyberpunk', 'Бита с шипами', 'Чебурашка', 'Рюкзак уточки', 
       'Спортивная сумка', 'Спортивная сумка Nike', 'Спортивная сумка Граффити', 'Тамагочи', 'Рюкзак аниме', 
       'Рюкзак с Грогу', 'Маленький санта', 'Золотой кейс', 'Серебряный кейс', 'Черный кейс', 
       'Кейс Биткоин', 'Кейс McDonalds', 'Летучие мыши', 'Распределяющая шляпа', 'Benis', 
       'Белый клюв', 'Часы Hello Kitty', 'Коричневый клюв', 'Черный клюв', 'Aig Bohay',
       'Унесенные призраками', 'Снитч', 'Кошачьи ушки', 'Наушники с кошачьими ушками', 'Черная маска', 
       'Черная маска с узорами', 'Коса', 'Коса смерти', 'Елочка', 'Клатч Balmain', 
       'Снаряжение оперативника Yorha', 'Уитли', 'Неваляшка', 'Шампур', 'Летающий призрак', 
       'Кибер Рудольф', 'Грустный кот', 'Черный кот', 'Белые крылья', 'Черные крылья', 
       'Красное крыло', 'Крылья падшего ангела', 'Мрачные крылья', 'Огненные крылья', 'Экзо крылья', 
       'Шлем танкиста', 'Кукла вуду', 'Рожки дьявола', 'Наушники с дьявольскими рожками', 'Маска Каратель', 
       'Маска ниндзя', 'Маска Kitsune', 'Паук', 'Попугай', 'Корона принца', 
       'Кукла Чаки', 'Пасхальная шляпа', 'Ворон', 'Черная бандана', 'Черная бандана с узорами', 
       'Белая бандана', 'Сумка Burberry', 'Пиратская треуголка', 'Палаш', 'Пасхальная корзина', 
       'Катана Дедпула', 'Двойные катаны Дедпула', 'Пес-призрак Зеро', 'Пирамидоголовый', 'Окулус', 
       'Очки тыквы', 'Рюкзак Домо-кун', 'Маска Куноити', 'Маска Мясника', 'Маска Ренча', 
       'Красные ушки', 'Ведьмина шляпа', 'Охотница', 'Зловещий призрак', 'Рюкзак Heartbeat', 
       'Рюкзак Biohazard', 'Белая панама', 'Рюкзак тыквы', 'Коническая шляпа Non La', 'Безликий', 
       'Белый договор', 'Розовые очки', 'Черный чумной доктор', 'Коричневый чумной доктор', 'Белый чумной доктор', 
       'Кролячьи ушки', 'Треуголка', 'Аномалия Электро', 'Аномалия Жарка', 'Противогаз киберпанк', 
       'Крушитель', 'Бабочки', 'Левитирующие свечи', 'Левитирующие леденцы', 'Черная сумка LV', 
       'Ушки Уэнсдей', 'Шлем с ушками', 'Клинок ничирин', 'OFF-WHITE', 'Кровавая лабубу', 
       'Глаза нежити', 'Вещь', 'Синий Стич', 'Розовый Стич', 'Новогодний мешок', 
       'Маска кролика', 'Тактический рюкзак', 'Белый контракт',
]

TuningForAuto = {
    'с ст1': 'с "Stage 1" ',
    'с ст1 и неоном': 'с "Stage 1", с н/п',
    'с ст1 и заниженной подвеской': 'с "Stage 1", с з/п',
    'с ст2 и неоном': 'с "Stage 2", с н/п',
    'с ст2, неоном и пневмой': 'с "Stage 2", с н/п, с п/п',
    'с ст3 и страбами': 'с "Stage 3", со с/с',
    'с ст3 и неоном': 'с "Stage 3", с н/п',
    'с ст3 и нитро': 'с "Stage 3", с з/а',
    'со страбами': 'со с/с',
    'с неоном': 'с н/п',
    'с пневмой': 'с п/п',
    'с гидравликой': 'с г/п',
}

Boxes = [
    'Новогодний', 'STAFF', 'Автомобильный I', 'Кладоискатель', 'Гонщик', 
    'Боевой', 'Майский', 'Майский II', 'Amazing I', 'Amazing II', 
    'Helloween', 'Nightmare', 'Porsche 911', 'STALKER', 'STALKER II', 
    'Анимационный', 'Анимационный II', 'Анимационный III', 'Desert Eagle',
]

Anims = [
    'Кукла колдуна', 'Crazy In Love', 'Epic Sax', 'Milly Rock', 'Jumpstyle', 
    'Funked Up', 'Happy Feets', 'Around Dance', 'Swing Fan', 'Free Arms', 
    'Bye Bye Bye', 'Добивание с ноги', 'Величие', 'Сальто назад', 'Присяд русского народного танца', 
    'Перекрещивание', 'Нижний брейк-данс', 'Танец маленьких утят', 'Танец Хип-Хоп', 'Танец Gangnam Style', 
    'Танец Макарена', 'Танец Твист', 'Танец Marashino', 'Рэперское чтение №5', 'Рэперское чтение №6', 
    'Down With The Sickness', 'Брейк-данс', 'Poker Face', 'Сияй', 'Better', 
    'APT', 'Rat Dance', 'Drop It Hot', 'Rasputin', 'Flux', 
    'Wave', 'Pumpkin Dance', 'Выгодная сделка', '9mm', 'Master of Puppets', 
    'Дементор', 'Танец Уэнсдей', 'Pacu Dance', 'Злобный смех', 'Здравствуй, мама', 
]

families = {
    'Набор в семью "dizbalans"': '[Поиск] Семья "dizbalans" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "La Corona Nera"': '[Поиск] Семья "La Corona Nera" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "CORVUS"': '[Поиск] Семья "CORVUS" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Luxury"': '[Поиск] Семья "Luxury" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "SQneo"': '[Поиск] Семья "SQneo" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "sacred squad"': '[Поиск] Семья "sacred squad" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Depression"': '[Поиск] Семья "Depression" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "rezervi"': '[Поиск] Семья "rezervi" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "rezervi club"': '[Поиск] Семья "rezervi club" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "welaw"': '[Поиск] Семья "welaw" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "welaw domination?"': '[Поиск] Семья "welaw domination?" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "ATTWOOD"': '[Поиск] Семья "ATTWOOD" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Old Family"': '[Поиск] Семья "Old Family" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "morreti squad"': '[Поиск] Семья "morreti squad" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "shadow of hate"': '[Поиск] Семья "shadow of hate" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "ВЕЛИЧИЕ Outwentur"': '[Поиск] Семья "ВЕЛИЧИЕ Outwentur" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "ТуЛеВа"': '[Поиск] Семья "ТуЛеВа" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "HELLDEATH"': '[Поиск] Семья "HELLDEATH" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "mask famq"': '[Поиск] Семья "mask famq" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Tokyo squad"': '[Поиск] Семья "Tokyo squad" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Horoshije production"': '[Поиск] Семья "Horoshije production" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "monteleon"': '[Поиск] Семья "monteleon" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Farengeint Dynasty"': '[Поиск] Семья "Farengeint Dynasty" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "supreme"': '[Поиск] Семья "supreme" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Big Hot Millioners"': '[Поиск] Семья "Big Hot Millioners" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "ARASAKA"': '[Поиск] Семья "ARASAKA" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Natural Famq"': '[Поиск] Семья "Natural Famq" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "ENEMY"': '[Поиск] Семья "ENEMY" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "undersize"': '[Поиск] Семья "undersize" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Rewayzze"': '[Поиск] Семья "Rewayzze" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Точка Контроля"': '[Поиск] Семья "Точка Контроля" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Best in hell"': '[Поиск] Семья "Best in hell" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Cannibal Corpse"': '[Поиск] Семья "Cannibal Corpse" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "ASKOBARO"': '[Поиск] Семья "ASKOBARO" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Brazzers"': '[Поиск] Семья "Brazzers" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "DOBRIY"': '[Поиск] Семья "DOBRIY" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Intense"': '[Поиск] Семья "Intense" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Manson"': '[Поиск] Семья "Manson" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Crystal"': '[Поиск] Семья "Crystal" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "GosNarkoControl"': '[Поиск] Семья "GosNarkoControl" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "NarkoControl"': '[Поиск] Семья "NarkoControl" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Sweet Kills"': '[Поиск] Семья "Sweet Kills" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Chillov"': '[Поиск] Семья "Chillov" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Black Angels"': '[Поиск] Семья "Black Angels" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Department"': '[Поиск] Семья "Department" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Tsunami Family"': '[Поиск] Семья "Tsunami Family" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Кубики Льда"': '[Поиск] Семья "Кубики Льда" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "Best In Hell"': '[Поиск] Семья "Best In Hell" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "BezPontov"': '[Поиск] Семья "BezPontov" ищет дальних родственников. Просьба связаться.',
    'Набор в семью "moonlight"': '[Поиск] Семья "moonlight" ищет дальних родственников. Просьба связаться.',
}

interviews = {
    'ищу работу в ТК': '[Работа] Трудоустроюсь в транспортную компанию. Просьба связаться.',
    'ищу работу в таксопарке': '[Работа] Трудоустроюсь в таксопарк. Просьба связаться.',
    'набираем людей в клуб "Байкеры"': '[Работа] Проходит собеседование в клуб "Байкеры". Мы в навигаторе: "7-2". Ждём вас.',
    'набираем людей в клуб "Скинхеды"': '[Работа] Проходит собеседование в клуб "Скинхеды". Мы в навигаторе: "7-1". Ждём вас.',
    'набираем людей в ЧОП "Русские мишки"': '[Работа] Проходит собеседование в ЧОП "Русские мишки". Мы в навигаторе: "7-4". Ждём вас.',
    'набираем людей в ЧОП "Кавказкие мишки"': '[Работа] Проходит собеседование в ЧОП "Кавказкие мишки". Мы в навигаторе: "7-3". Ждём вас. ',
    'прорекламируйте бизнес, навигатор: 8-1-1': '[Реклама] Работает бизнес "АЗС" в пгт. Батырево. Мы в навигаторе: 8-1-1.',
    'прорекламируйте бизнес, навигатор: 8-1-2': '[Реклама] Работает бизнес "АЗС" в г. Южный. Мы в нанавигаторе: 8-1-2.',
    'прорекламируйте бизнес, навигатор: 8-1-3': '[Реклама] Работает бизнес "АЗС" в г. Южный. Мы в навигаторе: 8-1-3.',
    'прорекламируйте бизнес, навигатор: 8-1-4': '[Реклама] Работает бизнес "АЗС" в г. Арзамас. Мы в навигаторе: 8-1-4.',
    'прорекламируйте бизнес, навигатор: 8-1-5': '[Реклама] Работает бизнес "АЗС" в г. Арзамас. Мы в навигаторе: 8-1-5.',
    'прорекламируйте бизнес, навигатор: 8-1-6': '[Реклама] Работает бизнес "АЗС" в пгт. Рыжевск. Мы в навигаторе: 8-1-6',
    'прорекламируйте бизнес, навигатор: 8-1-7': '[Реклама] Работает бизнес "АЗС" в пгт. Батырево. Мы в навигаторе: 8-1-7.',
    'прорекламируйте бизнес, навигатор: 8-1-8': '[Реклама] Работает бизнес "АЗС" в пос. Малая Эдовка. Мы в навигаторе: 8-1-8.',
    'прорекламируйте бизнес, навигатор: 8-2-1': '[Реклама] Работает бизнес "Магазин 24/7" в пгт. Батырево. Мы в навигаторе: 8-2-1.',
    'прорекламируйте бизнес, навигатор: 8-2-2': '[Реклама] Работает бизнес "Магазин 24/7" в пгт. Батырево. Мы в навигаторе: 8-2-2.',
    'прорекламируйте бизнес, навигатор: 8-2-3': '[Реклама] Работает бизнес "Магазин 24/7" в г. Южный. Мы в навигаторе: 8-2-3.',
    'прорекламируйте бизнес, навигатор: 8-2-4': '[Реклама] Работает бизнес "Магазин 24/7" в г. Южный. Мы в навигаторе: 8-2-4.',
    'прорекламируйте бизнес, навигатор: 8-2-5': '[Реклама] Работает бизнес "Магазин 24/7" в г. Южный. Мы в навигаторе: 8-2-5.',
    'прорекламируйте бизнес, навигатор: 8-2-6': '[Реклама] Работает бизнес "Магазин 24/7" в г. Арзамас. Мы в навигаторе: 8-2-6.',
    'прорекламируйте бизнес, навигатор: 8-2-7': '[Реклама] Работает бизнес "Магазин 24/7" в г. Арзамас. Мы в навигаторе: 8-2-7.',
    'прорекламируйте бизнес, навигатор: 8-2-8': '[Реклама] Работает бизнес "Магазин 24/7" в г. Южный. Мы в навигаторе: 8-2-8.',
    'прорекламируйте бизнес, навигатор: 8-2-9': '[Реклама] Работает бизнес "Магазин 24/7" на Рублёвке у г. Южный. Мы в навигаторе: 8-2-9.',
    'прорекламируйте бизнес, навигатор: 8-2-10': '[Реклама] Работает бизнес "Магазин 24/7" в г. Арзамас. Мы в навигаторе: 8-2-10.',
    'прорекламируйте бизнес, навигатор: 8-2-11': '[Реклама] Работает бизнес "Магазин 24/7" в г. Арзамас. Мы в навигаторе: 8-2-11.',
    'прорекламируйте бизнес, навигатор: 8-2-12': '[Реклама] Работает бизнес "Магазин 24/7" в пгт. Батырево. Мы в навигаторе: 8-2-12.',
    'прорекламируйте бизнес, навигатор: 8-2-13': '[Реклама] Работает бизнес "Магазин 24/7" у пос. Карьерный. Мы в навигаторе: 8-2-13.',
    'прорекламируйте бизнес, навигатор: 8-2-14': '[Реклама] Работает бизнес "Магазин 24/7" в г. Южный. Мы в навигаторе: 8-2-14.',
    'прорекламируйте бизнес, навигатор: 8-2-15': '[Реклама] Работает бизнес "Магазин 24/7" в д. Гарель. Мы в навигаторе: 8-2-15.',
    'прорекламируйте бизнес, навигатор: 8-2-16': '[Реклама] Работает бизнес "Магазин 24/7" в пос. Бусаево. Мы в навигаторе: 8-2-16.',
    'прорекламируйте бизнес, навигатор: 8-2-17': '[Реклама] Работает бизнес "Магазин 24/7" в г. Арзамас. Мы в навигаторе: 8-2-17.',
    'прорекламируйте бизнес, навигатор: 8-2-18': '[Реклама] Работает бизнес "Магазин 24/7" в пос. Малая Эдовка. Мы в навигаторе: 8-2-18.',
    'прорекламируйте бизнес, навигатор: 8-3-1': '[Реклама] Работает бизнес "Аптека" в г. Южный. Мы в навигаторе: 8-3-1.',
    'прорекламируйте бизнес, навигатор: 8-3-2': '[Реклама] Работает бизнес "Аптека" в пгт. Батырево. Мы в навигаторе: 8-3-2.',
    'прорекламируйте бизнес, навигатор: 8-3-3': '[Реклама] Работает бизнес "Аптека" в г. Южный. Мы в навигаторе: 8-3-3.',
    'прорекламируйте бизнес, навигатор: 8-3-4': '[Реклама] Работает бизнес "Аптека" г. Арзамас. Мы в навигаторе: 8-3-4.',
    'прорекламируйте бизнес, навигатор: 8-3-5': '[Реклама] Работает бизнес "Аптека" г. Арзамас. Мы в навигаторе: 8-3-5.',
    'прорекламируйте бизнес, навигатор: 8-3-6': '[Реклама] Работает бизнес "Аптека" в пгт. Рыжевск. Мы в навигаторе: 8-3-6.',
    'прорекламируйте бизнес, навигатор: 8-3-7': '[Реклама] Работает бизнес "Аптека" в ТЦ. Анашан. Мы в навигаторе: 8-3-7.',
    'прорекламируйте бизнес, навигатор: 8-3-8': '[Реклама] Работает бизнес "Аптека" в пос. Малая Эдовка. Мы в навигаторе: 8-3-8.',
    'прорекламируйте бизнес, навигатор: 8-4-1': '[Реклама] Работает бизнес "СТО" у ТЦ Анашан. Мы в навигаторе: 8-4-1.',
    'прорекламируйте бизнес, навигатор: 8-4-2': '[Реклама] Работает бизнес "СТО" в пгт. Батырево. Мы в навигаторе: 8-4-2.',
    'прорекламируйте бизнес, навигатор: 8-4-3': '[Реклама] Работает бизнес "СТО" в г. Арзамас. Мы в навигаторе: 8-4-3.',
    'прорекламируйте бизнес, навигатор: 8-4-4': '[Реклама] Работает бизнес "СТО" в г. Южный. Мы в навигаторе: 8-4-4.',
    'прорекламируйте бизнес, навигатор: 8-5-1': '[Реклама] Работает бизнес "Спортзал" в г. Южный. Мы в навигаторе: 8-5-1.',
    'прорекламируйте бизнес, навигатор: 8-6-1': '[Реклама] Работает бизнес "Риэлтор" в г. Южный. Мы в навигаторе: 8-6-1.',
    'прорекламируйте бизнес, навигатор: 8-6-2': '[Реклама] Работает бизнес "Риэлтор" в г. Арзамас. Мы в навигаторе: 8-6-2.',
    'прорекламируйте бизнес, навигатор: 8-7-1': '[Реклама] Работает бизнес "Нотариус" в г. Южный. Мы в навигаторе: 8-7-1.',
    'прорекламируйте бизнес, навигатор: 8-7-2': '[Реклама] Работает бизнес "Нотариус" в г. Арзамас. Мы в навигаторе: 8-7-2.',
    'прорекламируйте бизнес, навигатор: 8-8-1': '[Реклама] Работает бизнес "Магазин одежды" в г. Южный. Мы в навигаторе: 8-8-1.',
    'прорекламируйте бизнес, навигатор: 8-8-2': '[Реклама] Работает бизнес "Магазин одежды" в г. Арзамас. Мы в навигаторе: 8-8-2.',
    'прорекламируйте бизнес, навигатор: 8-8-3': '[Реклама] Работает бизнес "Магазин одежды" в пгт. Батырево. Мы в навигаторе: 8-8-3.',
    'прорекламируйте бизнес, навигатор: 8-9-1': '[Реклама] Работает бизнес "Магазин оружия" в г. Южный. Мы в навигаторе: 8-9-1.',
    'прорекламируйте бизнес, навигатор: 8-9-2': '[Реклама] Работает бизнес "Магазин оружия" в пгт. Батырево. Мы в навигаторе: 8-9-2.',
    'прорекламируйте бизнес, навигатор: 8-9-3': '[Реклама] Работает бизнес "Магазин оружия" в пгт. Рыжевск. Мы в навигаторе: 8-9-3.',
    'прорекламируйте бизнес, навигатор: 8-9-4': '[Реклама] Работает бизнес "Магазин оружия" в г. Арзамас. Мы в навигаторе: 8-9-4.',
    'прорекламируйте бизнес, навигатор: 8-10-1': '[Реклама] Работает бизнес "Тюнинг-Центр" в пгт. Батырево. Мы в навигаторе: 8-10-1.',
    'прорекламируйте бизнес, навигатор: 8-10-2': '[Реклама] Работает бизнес "Тюнинг-Центр" в г. Арзамас. Мы в навигаторе: 8-10-2.',
    'прорекламируйте бизнес, навигатор: 8-11-1': '[Реклама] Работает бизнес "Закусочная" в Южной Рублевке. Мы в навигаторе: 8-11-1.',
    'прорекламируйте бизнес, навигатор: 8-11-2': '[Реклама] Работает бизнес "Закусочная" у ТЦ Анашан. Мы в навигаторе: 8-11-2.',
    'прорекламируйте бизнес, навигатор: 8-11-3': '[Реклама] Работает бизнес "Закусочная" напротив ЕСС. Мы в навигаторе: 8-11-3.',
    'прорекламируйте бизнес, навигатор: 8-11-4': '[Реклама] Работает бизнес "Закусочная" напротив рынка г. Южный. Мы в навигаторе: 8-11-4.',
    'прорекламируйте бизнес, навигатор: 8-11-5': '[Реклама] Работает бизнес "Закусочная" на вокзале в пгт. Батырево. Мы в навигаторе: 8-11-5.',
    'прорекламируйте бизнес, навигатор: 8-11-6': '[Реклама] Работает бизнес "Закусочная" у Центрального рынка. Мы в навигаторе: 8-11-6.',
    'прорекламируйте бизнес, навигатор: 8-11-7.': '[Реклама] Работает бизнес "Закусочная" у Фермы в пгт. Батырево. Мы в навигаторе: 8-11-7.',
    'прорекламируйте бизнес, навигатор: 8-11-8': '[Реклама] Работает бизнес "Закусочная" на набережной г. Арзамас. Мы в навигаторе: 8-11-8.',
    'прорекламируйте бизнес, навигатор: 8-11-9': '[Реклама] Работает бизнес "Закусочная" в пгт. Рыжевск. Мы в навигаторе: 8-11-9.',
    'прорекламируйте бизнес, навигатор: 8-11-10': '[Реклама] Работает бизнес "Закусочная" в комп. клубе г. Южный. Мы в навигаторе: 8-11-10.',
    'прорекламируйте бизнес, навигатор: 5-3': '[Разное] На набережной г. Арзамас проходит концерт. Мы в навигаторе: 5-3',
}

Resources = [
    'Пластик', 'Алюминий', 'Хлопок', 'Мусор', 'Золотая руда',
    'Железная руда', 'Алмазная руда', 'Алюминиевая банка', 'Серебряная руда', 'Нитки',
    'Электроника', 'Солома', 'Иголки', 'Банка с краской', 'Тряпки',
    'Доски', 'Золотой слиток', 'Серебряный слиток', 'Бриллиант', 'Железный слиток',
]

other = {
    'свежую рыбу, прошлогодняя пойдёт тоже': 'свежую рыбу',                     ###ПАСХАЛКА
    'жареную рыбу': 'жареную рыбу',
    'сеть Амазинг': 'рыболовную сеть "Amazing"',
    'муз центр панасоник': 'музыкальный центр "Panasonic"',
    'бумбокс': 'колонку фирмы "Бумбокс"',
    'аудиосистему': 'аудиосистему на автомобиль',
    'макет с4': 'макет "С4"',
    'сигареты Беломор': 'пачку сигарет "Беломор"',
    'карты "Владимирский централ"': 'колоду карт "Владимирский централ"',
    'карты "Матросская тишина"': 'колоду карт "Матросская тишина"',
    'карты "Бутырка"': 'колоду карт "Бутырка"',
    'карты "Белый лебедь"': 'колоду карт "Белый лебедь"',
    'карты "Чёрный дельфин"': 'колоду карт "Чёрный дельфин"',
    'карты "Кресты" для Севыча ГотОчкина': 'колоду карт "Кресты"',              ###ПАСХАЛКА
    'баллончики': 'баллончики с краской',
    'балончики амазинг': 'баллончики с краской "Amazing"',
    'снарягу для пейнтбола': 'пейнтбольное снаряжение',
    'пульки для страйкбола': 'резиновые пульки',
    'чаёк тесс': 'чай фирмы "Tess"',
    'мятные конфеты "Scandic" (Мне не платили)': 'мятные конфетки',             ###ПАСХАЛКА
    'отбойный Молотх': 'инструмент "Отбойный молоток"',                         ###ПАСХАЛКА
    'метлу': 'инструмент "Метла"',
    'золотую лопату': 'инструмент "Золотая лопата"',
    'бензопилу': 'инструмент "Бензопила"',
    'слот для павика': 'дополнительный слот для торгового павильона',
    'павик на ЦР': 'торговый павильон на Центральном рынке',
    'павик на ашике': 'торговый павильон на Анашане',
    'павик': 'торговый павильон',
    'пустую тепличку': 'теплицу для фермы',
    'теплицу с урожаем': 'теплицу с урожаем',
    'большую тепличку': 'большую теплицу для фермы',
    'среднюю тепличку': 'среднюю теплицу для фермы',
    'маленькую тепличку': 'маленькую теплицу для фермы',
}

Prices = {

    'Nothing': '',

    'ЗиС-101А Спорт': '',
    'ГАЗ-13 Чайка': '',
    'Ford Falcon XB PS': '',
    'Dodge Viper SRT': '',
    'Lotus Evija': '',
    'Chevrolet Camaro SS VI': '',
    'Chevrolet Camaro I': '',
    'Alfa Romeo Giulia': '',
    'HiPhi Z': '',
    'Impala SS Hardtop': '',
    'TLC Prado AT': '',
    'R-R Ghost Limousine': '',
    'Peugeot 406 Truck': '',
    'Багги Bandito': '',
    'Honda NSX NA1': '',
    'Suzuki Jimny JB74': '',
    'Nissan Silvia S13': '',
    'Nissan Silvia S14': '',
    'ВАЗ-21099': '150000',
    'LADA Largus Cross': '1300000',
    'Subaru Legacy BC': '350000',
    'ЗАЗ-968А': '',
    'ЗАЗ-968М': '50000',
    'Гольф-кар': '',
    'Kia Rio': '800000',
    'BMW X5М Competition': '17000000',
    'BMW X5М': '',
    'BMW X7 G07': '',
    'BMW X5 E53': '',
    'BMW i8': '9000000',
    'BMW М8 F92': '',
    'BMW М8 F93': '',
    'BMW M6 F13': '',
    'BMW M5 E39': '',
    'BMW M5 E34': '',
    'BMW M5 E60': '5000000',
    'BMW M5 F10': '7000000',
    'BMW M5 F90': '12000000',
    'BMW M5 G90': '',
    'BMW M4 F82': '12000000',
    'BMW M4 G83 xDrive': '',
    'BMW M4 G82': '',
    'BMW M3 E30 Cabrio': '',
    'Skoda octavia mk3': '1000000',
    'BMW M3 E46': '',
    'BMW M3 E92': '',
    'BMW M2 F87': '4500000',
    'BMW M3 E92': '',
    'BMW 750iL E38': '',
    'BMW M3 E36': '',
    'Fiat 500 Abarth': '',
    'MB S600 W140': '',
    'MB E500 W124': '',
    'MB CLS 400 4-Matic': '7000000',
    'MB CLS w219': '',
    'MB Sprinter': '4500000',
    'MB E55 AMG W210': '',
    'MB AMG GT S X290': '15000000',
    'MB AMG GT 4-DС': '',
    'MB S650 W222': '15000000',
    'MB G65 W463': '10000000',
    'УАЗ-469 Stalker': '',
    'MB 190е w201 Evo II': '',
    'MB G63 W464': '20000000',
    'MB G63 4х4': '25000000',
    'MB E63 W212': '5000000',
    'MB E63s W213': '12000000',
    'MB C63 W205': '7500000',
    'MB GLE63s AMG': '13000000',
    'MB AVTR': '',
    'MB AMG GTR': '17000000',
    'MB S450 W223': '20000000',
    'M-M GLS 600': '45000000',
    'MB X-Class W470': '',
    'MB V-Class W447': '',
    'УАЗ Patriot': '400000',
    'УАЗ 3303': '',
    'ГАЗ-3110': '100000',
    'Range Rover': '',
    'Honda Civic Type-R EK9': '800000',
    'Honda S2000': '',
    'Honda Civic Type-R FK8': '2500000',
    'Toyota Crown': '4000000',
    'Skoda Octavia': '1000000',
    'ВАЗ-2101': '200000',
    'ВАЗ-2102': '',
    'ВАЗ-2104': '80000',
    'ВАЗ-2105': '80000',
    'ВАЗ-2106': '80000',
    'ВАЗ-2107': '100000',
    'ВАЗ-2108': '90000',
    'ВАЗ-2109': '100000',
    'ВАЗ-2110': '150000',
    'ВАЗ-2112': '200000',
    'ВАЗ-2113': '',
    'ВАЗ-2114': '150000',
    'ВАЗ-1111 Ока': '',
    'Lada Priora': '400000',
    'Lada Granta': '300000',
    'Lada Vesta': '1000000',
    'Lada Vesta SW': '500000',
    'Lada 4x4': '500000',
    'Audi R8 2G': '15000000',
    'Audi RS6 C7': '',
    'Audi RS6 C8': '18000000',
    'Ch. Monster': '',
    'Ch. Corvette C3': '',
    'Ch. Corvette C7': '',
    'Ch. Corvette ZR1 C8': '',
    'Audi RS7 C8': '',
    'Audi S3 Sedan': '',
    'Audi TT': '2500000',
    'Toyota Supra A90': '8500000',
    'Toyota Supra A80': '',
    'Toyota Trueno AE86': '',
    'Toyota Mark II X100': '',
    'Toyota Camry XV50': '2000000',
    'Toyota Camry XV70': '4000000',
    'Toyota Chaser': '',
    'Toyota Land Cruiser 200': '10000000',
    'Toyota Land Cruiser 300': '14000000',
    'Toyota Alphard': '',
    'Toyota GT86': '3000000',
    'Renault Logan': '600000',
    'LR RR Velar L560': '8000000',
    'LR RR SVA': '12000000',
    'Volkswagen Golf MKI': '',
    'Volkswagen ID. Buzz': '',
    'Volkswagen Multivan': '',
    'Mazda RX-8': '1200000',
    'Mazda RX-7': '',
    'McLaren Senna': '',
    'Can-Am Meverick X3': '',
    'DeLorean DMC-12': '',
    'Nissan GT-R R35': '16000000',
    'Nissan SkyLine GT-R 34': '',
    'Nissan SkyLine GT-R 33': '',
    'Nissan SkyLine GT-R 32': '',
    'Nissan Fairlady 240z': '',
    'Nissan Silvia S15': '',
    'Nissan Titan': '',
    'Nissan 370z': '',
    'Ford Focus': '500000',
    'Ford Model B': '',
    'Ford F-150 Raptor': '9000000',
    'Ford Mustang GT': '',
    'Quadra V-Tech': '',
    'Ford Hot-Road': '',
    'Dodge RAM 1500 Rebel TRX': '14000000',
    'Dodge Charger SRT': '',
    'Dodge Charger SRT Hellcat': '4000000',
    'Dodge Challenger R/T': '3000000',
    'Bentley Continental': '15000000',
    'Bentley Bentyaga': '12000000',
    'Jeep Gladiator': '',
    'Jeep Grand Cherokee': '',
    'Hummer EV': '',
    'Hummer H1': '',
    'Bugatti Chiron': '',
    'Bugatti EB110': '',
    'Infiniti Q50': '',
    'Flanker F': '',
    'Cadillac Escalade': '5000000',
    'Cadillac Deville 1949': '',
    'GMC Vandura': '1200000',
    'Subaru Impreza WRX STI': '',
    'Subaru Impreza WRX STI GD': '',
    'Subaru Impreza WRX STI GR': '5000000',
    'Lamborghini Urus': '37000000',
    'Lamborghini Huracan': '40000000',
    'Lamborghini Aventador': '40000000',
    'Jaguar F-Type': '4000000',
    'Porsche Panamera': '',
    'Porsche Cayenne': '15000000',
    'Porsche Cayenne Coupe': '',
    'Porsche 911 (991)': '',
    'Porsche 911 GT3 (992)': '',
    'Porsche 911 (992)': '',
    'Porsche Taycan': '19000000',
    'ГАЗ-66': '',
    'Ferarri 458 Italia': '',
    'Ferarri GTC4Lucco': '',
    'Holden Sandman HQ Panelvan': '',
    'Венный КамАЗ-43118': '',
    'КаВЗ-685': '',
    'ГАЗ-24 Кабриолет': '',
    'Mitsubishi Lancer Evo IX': '',
    'Mitsubishi Lancer Evo X': '',
    'R-R Culinan': '',
    'R-R Phantom': '45000000',
    'Lexus IS-F': '',
    'Lexus LX570 URJ201': '10000000',
    'Lexus LC500 URZ100': '',
    'Lexus LX600': '',
    'Lexus RX350': '9000000',
    'Lexus IS 350': '',
    'Lexus IS300': '',
    'Lexus 750': '',
    'Tesla CyberTruck': '',
    'Tesla Model S': '10000000',
    'Rolls-Royce Dawn': '',
    'Зил - 130': '',
    'Ferrari F12tdf': '',
    'Ferrari F40': '',
    'Ferrari F488 GTB': '20000000',
    'Ferrari F8 Tributo': '',
    'Bentley Ultratank': '',
    'Maserati Levante': '',
    'Mitsubishi Pajero V80': '',
    'Nissan Pulsar GTI-R': '',
    'Nissan 240SX': '',
    'Tesla Model S Plaid': '',
    'Volvo VNL670': '',
    'Урал-4320 Next': '',
    'Volkswagen Golf MK8 GTI': '',
    'Volkswagen Polo Liftback': '1500000',
    'Aurus Senat': '',
    'Aurus Senat Convertible': '',
    'MINI John Cooper Works GP': '',
    'Volkswagen Transporter T6': '',
    'Lada Niva Travel': '1500000',
    'BMW M3 Touring G81': '',
    'BMW 2002 Turbo': '',
    'Mercedes-Benz EQS 580': '',
    'Audi RS4 (B5)': '',
    'ГАЗ М-20': '',
    'Ford Mustang Hoonicorn': '',
    'Audi RS Q8': '',
    'Volkswagen Transporter T6': '',
    'BMW M3 F80': '',
    'Nissan Fairlady Z RZ34': '',
    'УАЗ СГР': '150000',
    'Hyundai N Vision 74': '',
    'Буханка 2077': '',
    'MB C-class W204 AMG': '',
    'KTM X-Bow': '',
    'BMW X6M Competition F96': '',
    'Dodge Challenger SRT Demon': '',
    'Porsche 911 (930)': '',
    'BMW M3 G80': '',
    'Ford GT40': '',
    'Saleen S7': '',
    'ВАЗ-2329': '',
    'Ford Mustang Shelby GT500': '',
    'Daewoo Matiz M150': '',
    'Proto Speedster': '',
    'LiXiang L9': '9500000',
    'Ява': '200000',
    'Yamaha MT10': '',
    'Ducati Desmodesici RR': '4000000',
    'KTM 350 EXC-F': '750000',
    'Ducati XDiavel S': '1900000',
    'BMW S1000RR': '3000000',
    'KTM 1290 Super Duke R': '2500000',

    'Мастер кунг-фу': '',
    'Снежный эльф': '',
    'Девушка в персиковом': '', 
    'Дора': '',
    'Футболка One': '20000000', 
    'Сутенёр': '',
    'Конор МакГрегор': '', 
    'Хасбик': '',
    'Гангстер с татуировками': '',
    'Девушка в парандже': '',
    'Маленький мальчик': '5500000',
    'Рубашка на поясе': '',
    'Маленькая девочка': '',
    'Мейби Бейби': '',
    'Белый шейх': '',
    'Близняшка': '',
    'Cyberpunk': '',
    'Мияги': '',
    'Pyrex': '',
    'Якудза': '',
    'Бомж': '',
    'Бомж с табличкой': '',
    'Байкер': '',
    'Девон Аоки': '',
    'Хабиб': '',
    'Черный опер': '', 
    'Красный опер': '',
    'Бабушка': '',
    'Навальный': '',
    'Жириновский': '',
    'Биг Смоук': '',
    'Биг Смоук в бронежилете': '',
    'Бизнес леди': '',
    'Gawr Gura': '',
    'Федя Чу': '',
    'Джон Уик': '',
    'Администратор': '',
    'Девушка в хиджабе': '',
    'Дед Мороз': '',
    '2В': '',
    'Джо Барбаро': '',
    'Ведьма': '',
    'Кощей': '',
    'Элвис': '',
    'Белый Элвис': '',
    'Синий Элвис': '',
    'Давидыч': '',
    'Томас Шелби': '',
    'Рейдерша': '',
    'Ву Зи Му': '',
    'Лапенко': '',
    'Снегурочка': '',
    'Правительство': '',
    'Моргенштерн': '',
    'Фермер': '',
    'Сергей Бодров': '', 
    'Нурлан Сабуров': '',
    'Чертяка с тыквой': '',
    'Лукашенко': '',
    'Петух': '',
    'Шоколадка': '', 
    'Deadpool': '',
    'Макима': '',
    'Маска': '',
    'Тыквенная леди': '', 
    'Жекич Дубровский': '',
    'Парикмахер': '',
    'Скуф': '',
    'Гонщик Стиг': '', 
    'Паша Техник': '',
    'Дин Винчестер': '',
    'Covid-19': '',
    'Монашка': '',
    'Косплей монашки': '',
    'Рыбак': '',
    'Уличный': '2000000',
    'Наркобарон': '',
    'Ученица-маг': '',
    'Alt Girl': '',
    'Демон': '',
    'Мотоциклистка': '',
    'Девушка (Сталкер)': '', 
    'Тактический сталкер': '',
    'Гокудо': '',
    'Триада': '11000000',
    'Девушка в пижаме': '', 
    'Теннисистка': '',
    'Илон Маск': '',
    'Уэнсдей': '',
    'Школьница': '',
    'Шинобу': '',
    'Пляжник': '',
    'Пляжница': '',
    'Девушка в полосатом': '', 
    'Кромешник': '',
    'Светящийся костюм': '',
    'Скелет': '',
    'Костюм единорожки': '',
    'Спектра': '',
    'Горк': '',

    'Стероиды': '50000',
    'Шпалера': '',
    'Стимулятор': '200000',
    'Пружины': '4000',
    'Большая аптечка': '40000',
    'Адреналин-S': '40000',
    'Золотая рулетка': '700000',
    'МП COIN': '5000',
    'AMZ COIN': '',
    'Ведро с эмульсией': '50000',
    'Ведро с эмульсией Ultra': '150000',
    'MultiTools': '80000',
    'Крестик ручной работы': '10000',
    'Чётки перекидные': '',
    'Мусорное ведро': '',
    'Ведро': '',

    'АН-94 Абакан': '',
    'Desert Eagle': '',
    'ОЦ-14 Гроза': '',
    'ТЕС-9': '',
    'СВД-ПСО': '',
    'Striker-12': '',
    'АС Вал': '',
    'Glock-18': '',
    'CKC': '',
    'М4А4': '35000000',
    'Снятие номеров': '2500000',
    'Починка инструмента': '500000',
    'Снятие неона': '5000000',
    'Снятие номерной рамки': '600000',
    'Смена оттенка фар': '',
    'Безопасное улучшение аксессуара': '1700000',
    'Усиленное улучшение аксессуара': '400000',
    'Улучшение аксессуара': '280000',
    'Ящик с материалами': '200000',
    'Ящик с консервами': '',
    'Большая аптечка': '60000',
    'Армейская аптечка': '',
    'Адреналин': '70000',
    'Наган': '',

    'дополнительный багажник для автомобиля': '10000000',
    'градиентовую покраску для автомобиля': '30000000',
    'дополнительный бак для автомобиля': '23000000',
    'неоновую подсветку "Градиент" на автомобиль': '5000000',
    'неоновую подсветку "Радуга" на автомобиль': '5000000',
    'неоновую подсветку "Статичная" на автомобиль': '10000000',
    'элемент тюнинга "Stage 1" для автомобиля': '700000',
    'элемент тюнинга "Stage 2" для автомобиля': '10000000',
    'элемент тюнинга "Stage 3" для автомобиля': '25000000',
    'пневмоподвеску для автомобиля': '65000000',
    'стробоскопы на автомобиль': '45000000',
    'закись азота для автомобиля': '30000000',
    'гидроподвеску для автомобиля': '30000000',
    'цветные рамки под г/н': '',
    'брендовые рамки под г/н': '20000000',

    'house': '4000000',

    'Кукурузы': '35000',
    'Картофель': '30000',
    'Тыквы': '60000',
    'Перца': '30000',
    'Лук репчатый': '50000',
    'Арбуза': '30000',
    'Баклажаны': '20000',
    'Помидора': '28000',
    'Чеснок': '25000',
    'Морковь': '20000',

    'с "Stage 1" ': '350000',
    'с "Stage 1", с н/п': '5000000',
    'с "Stage 1", с з/п': '1000000',
    'с "Stage 2", с н/п': '10000000',
    'с "Stage 2", с н/п, с п/п': '50000000',
    'с "Stage 3", со с/с': '40000000',
    'с "Stage 3", с н/п': '20000000',
    'с "Stage 3", с з/а': '30000000',
    'со с/с': '22000000',
    'с н/п': '5000000',
    'с п/п': '35000000',
    'с г/п': '15000000',

    'Колос пшеницы': '',
    'RGB рюкзак': '',
    'Голубые крылья': '120000000',
    'Шеврон звезда СССР': '500000',
    'RGB наушники': '',
    'Кожаный рюкзак': '',
    'Новогодний GIF рюкзак': '',
    'Маска Они': '',
    'Ушанка черная': '',
    'Ушанка розовая': '',
    'Бронзовый кейс': '',
    'Ушанка' : '',
    'Сигара' : '55000000',
    'Плюшевый Осьминог': '',
    'Черная женская шляпа': '',
    'Эльфийский венок': '8000000',
    'Бронежилет': '',
    'Пиксельный бронежилет': '6000000',
    'Бронежилет карателя': '',
    'Бронежилет сталкера': '',
    'Крылья феи': '',
    'Катана Cyberpunk': '',
    'Бита с шипами': '',
    'Чебурашка': '',
    'Рюкзак уточки': '',
    'Спортивная сумка': '3800000',
    'Спортивная сумка Nike': '',
    'Спортивная сумка Граффити': '',
    'Тамагочи': '',
    'Рюкзак аниме': '',
    'Рюкзак с Грогу': '',
    'Маленький санта': '',
    'Золотой кейс': '',
    'Серебряный кейс': '',
    'Черный кейс': '',
    'Кейс Биткоин': '',
    'Кейс McDonalds': '',
    'Летучие мыши': '',
    'Распределяющая шляпа': '',
    'Benis': '',
    'Белый клюв': '',
    'Часы Hello Kitty': '55000000',
    'Коричневый клюв': '',
    'Черный клюв': '',
    'Aig Bohay': '100000',
    'Унесенные призраками': '',
    'Снитч': '',
    'Кошачьи ушки': '',
    'Наушники с кошачьими ушками': '',
    'Черная маска': '',
    'Черная маска с узорами': '',
    'Коса': '',
    'Коса смерти': '',
    'Елочка': '',
    'Клатч Balmain': '',
    'Снаряжение оперативника Yorha': '',
    'Уитли': '',
    'Неваляшка': '1000000',
    'Шампур': '1000000',
    'Летающий призрак': '',
    'Кибер Рудольф': '',
    'Грустный кот': '',
    'Черный кот': '',
    'Белые крылья': '',
    'Черные крылья': '',
    'Красное крыло': '',
    'Крылья падшего ангела': '',
    'Мрачные крылья': '',
    'Огненные крылья': '',
    'Экзо крылья': '',
    'Шлем танкиста': '',
    'Кукла вуду': '',
    'Рожки дьявола': '',
    'Наушники с дьявольскими рожками': '',
    'Маска Каратель': '',
    'Маска ниндзя': '',
    'Маска Kitsune': '',
    'Паук': '',
    'Попугай': '2000000',
    'Корона принца': '',
    'Кукла Чаки': '',
    'Пасхальная шляпа': '',
    'Ворон': '200000',
    'Черная бандана': '',
    'Черная бандана с узорами': '',
    'Белая бандана': '',
    'Сумка Burberry': '',
    'Пиратская треуголка': '',
    'Палаш': '',
    'Пасхальная корзина': '',
    'Катана Дедпула': '',
    'Двойные катаны Дедпула': '',
    'Пес-призрак Зеро': '',
    'Пирамидоголовый': '',
    'Окулус': '',
    'Очки тыквы': '',
    'Рюкзак Домо-кун': '',
    'Маска Куноити': '',
    'Маска Мясника': '',
    'Маска Ренча': '',
    'Красные ушки': '',
    'Ведьмина шляпа': '',
    'Охотница': '',
    'Зловещий призрак': '',
    'Рюкзак Heartbeat': '',
    'Рюкзак Biohazard': '',
    'Белая панама': '',
    'Рюкзак тыквы': '',
    'Коническая шляпа Non La': '120000000',
    'Безликий': '',
    'Белый договор': '',
    'Розовые очки': '',
    'Черный чумной доктор': '',
    'Коричневый чумной доктор': '',
    'Белый чумной доктор': '',
    'Кролячьи ушки': '',
    'Треуголка': '',
    'Аномалия Электро': '',
    'Аномалия Жарка': '',
    'Противогаз киберпанк': '',
    'Крушитель': '2200000',
    'Бабочки': '',
    'Левитирующие свечи': '',
    'Левитирующие леденцы': '',
    'Черная сумка LV': '',
    'Ушки Уэнсдей': '',
    'Шлем с ушками': '',
    'Клинок ничирин': '',
    'OFF-WHITE': '',
    'Кровавая лабубу': '',
    'Глаза нежити': '',
    'Вещь': '',
    'Синий Стич': '38000000',
    'Розовый Стич': '33000000',
    'Новогодний мешок': '',
    'Маска кролика': '',
    'Тактический рюкзак': '',
    'Белый контракт': '',

    'Новогодний': '',
    'STAFF': '26000000',
    'Автомобильный I': '',
    'Кладоискатель': '',
    'Гонщик': '',
    'Боевой': '',
    'Майский': '',
    'Майский II': '',
    'Amazing I': '',
    'Amazing II': '',
    'Helloween': '',
    'Nightmare': '15000000',
    'Porsche 911': '2200000',
    'STALKER': '',
    'STALKER II': '',
    'Анимационный': '',
    'Анимационный II': '2000000',
    'Анимационный III': '2200000',
    'Desert Eagle': '',

    'Кукла колдуна': '26000000',
    'Crazy In Love': '6600000',
    'Epic Sax': '',
    'Milly Rock': '3500000',
    'Jumpstyle': '3200000',
    'Funked Up': '3000000',
    'Happy Feets': '1300000',
    'Around Dance': '',
    'Swing Fan': '',
    'Free Arms': '',
    'Bye Bye Bye': '',
    'Добивание с ноги': '',
    'Величие': '',
    'Сальто назад': '',
    'Присяд русского народного танца': '',
    'Перекрещивание': '',
    'Нижний брейк-данс': '',
    'Танец маленьких утят': '',
    'Танец Хип-Хоп': '',
    'Танец Gangnam Style': '',
    'Танец Макарена': '',
    'Танец Твист': '',
    'Танец Marashino': '',
    'Рэперское чтение №5': '',
    'Рэперское чтение №6': '',
    'Down With The Sickness': '',
    'Брейк-данс': '',
    'Poker Face': '',
    'Сияй': '',
    'Better': '',
    'APT': '',
    'Rat Dance': '',
    'Drop It Hot': '',
    'Rasputin': '',
    'Flux': '',
    'Wave': '',
    'Pumpkin Dance': '',
    'Выгодная сделка': '',
    '9mm': '',
    'Master of Puppets': '',
    'Дементор': '',
    'Танец Уэнсдей': '',
    'Pacu Dance': '',
    'Злобный смех': '',
    'Здравствуй, мама': '',

    'Пластик': '400000',
    'Алюминий': '20000',
    'Хлопок': '350000',
    'Мусор': '6000',
    'Золотая руда': '110000',
    'Железная руда': '55000',
    'Алмазная руда': '100000',
    'Алюминиевая банка': '6000',
    'Серебряная руда': '20000',
    'Нитки': '40000',
    'Электроника': '220000',
    'Солома': '7000',
    'Иголки': '30000',
    'Банка с краской': '2200000',
    'Тряпки': '4000',
    'Доски': '30000',
    'Золотой слиток': '220000',
    'Серебряный слиток': '50000',
    'Бриллиант': '330000',
    'Железный слиток': '150000',

    'свежую рыбу': '200',
    'жареную рыбу': '5000',
    'рыболовную сеть "Amazing"': '300000',
    'музыкальный центр "Panasonic"': '7600000',
    'колонку фирмы "Бумбокс"': '45000000',
    'аудиосистему на автомобиль': '39000000',
    'макет "С4"': '500000',
    'пачку сигарет "Беломор"': '6000',
    'колоду карт "Владимирский централ"': '30000',
    'колоду карт "Матросская тишина"': '10000',
    'колоду карт "Бутырка"': '30000',
    'колоду карт "Белый лебедь"': '20000',
    'колоду карт "Чёрный дельфин"': '70000',
    'колоду карт "Кресты"': '700000',
    'баллончики с краской': '',
    'баллончики с краской "Amazing"': '',
    'пейнтбольное снаряжение': '',
    'резиновые пульки': '',
    'чай фирмы "Tess"': '2000',
    'мятные конфетки': '5000',
    'инструмент "Отбойный молоток"': '1000000',
    'инструмент "Метла"': '1000000',
    'инструмент "Золотая лопата"': '1000000',
    'инструмент "Бензопила"': '1000000',
    'дополнительный слот для торгового павильона': '',
    'торговый павильон на Центральном рынке': '500000',
    'торговый павильон на Анашане': '100000',
    'торговый павильон': '500000',
    'теплицу для фермы': '100000',
    'теплицу с урожаем': '1200000',
    'большую теплицу для фермы': '300000',
    'среднюю теплицу для фермы': '200000',
    'маленькую теплицу для фермы': '100000',

}

def SummOrBank(searching, prices, tune = 'Nothing'):                                        ###ФУНКЦИЯ ДЛЯ ВЫБОРА ДЕЙСТВИЯ И СУММЫ В ОБОИХ ВАРИАНТАХ
    choice = random.randint(0, 1)
    if prices[searching] != '': 

        FreeOrPrice = random.randint(0, 1)

        if FreeOrPrice == 0 or FreeOrPrice == 1:

            low = int(prices[searching]) - int(prices[searching]) / 10
            height = int(prices[searching]) + int(prices[searching]) / 10
            price = str(random.randint(int(low), int(height)))

            if prices[tune] != '': price = int(price) + int(prices[tune])
            else: pass

            price = str(price)

            lenght = len(price)
            if lenght == 5: price =  int(price) / 1000                      ###10.000 
            elif lenght == 6: price =  int(price) / 10000                      ###100.000 
            elif lenght == 7: price =  int(price) / 100000                      ###1.000.000 
            elif lenght == 8: price =  int(price) / 1000000                      ###10.000.000 
            elif lenght == 9: price =  int(price) / 10000000                      ###100.000.000 
            else: price =  int(int(price) / 100) * 100           ###1.000 


            price = str(int(price))

            if lenght == 5: price =  int(price) * 1000                      ###10.000 
            elif lenght == 6: price =  int(price) * 10000                      ###100.000 
            elif lenght == 7: price =  int(price) * 100000                      ###1.000.000 
            elif lenght == 8: price =  int(price) * 1000000                      ###10.000.000 
            elif lenght == 9: price =  int(price) * 10000000                      ###100.000.000
            price = str(price)[::-1]
            PriceWithDots = ''
            counter = 0
            for i in price:
                counter += 1
                if counter == 4:
                    PriceWithDots += '.'
                    counter = 1
                    PriceWithDots += i
                else: 
                    PriceWithDots += i
            EngPrice = PriceWithDots[::-1]
            RusPrice = ''

            RusPrice = EngPrice
            RusPrice = RusPrice.replace('.100.000', 'кк 100к')
            RusPrice = RusPrice.replace('.200.000', 'кк 200к')
            RusPrice = RusPrice.replace('.300.000', 'кк 300к')
            RusPrice = RusPrice.replace('.400.000', 'кк 400к')
            RusPrice = RusPrice.replace('.500.000', 'кк 500к')
            RusPrice = RusPrice.replace('.600.000', 'кк 600к')
            RusPrice = RusPrice.replace('.700.000', 'кк 700к')
            RusPrice = RusPrice.replace('.800.000', 'кк 800к')
            RusPrice = RusPrice.replace('.900.000', 'кк 900к')
            RusPrice = RusPrice.replace('.000.000', 'кк')
            RusPrice = RusPrice.replace('.000', 'к')

            if choice == 0:
                firsteng = 'Продам'
                firstrus = 'продаю'
                lasteng = f'Цена: {EngPrice} рублей.'
                lastrus = f'за {RusPrice}'
                return [firsteng, firstrus, lasteng, lastrus]
            else:
                firsteng = 'Куплю'
                firstrus = 'куплю'
                lasteng = f'Бюджет: {EngPrice} рублей.'
                lastrus = f'за {RusPrice}'
                return [firsteng, firstrus, lasteng, lastrus]  

        else:
            if choice == 0:
                firsteng = 'Продам'
                firstrus = 'продаю'
                lasteng = 'Цена договорная.'
                lastrus = ''
                return [firsteng, firstrus, lasteng, lastrus]
            else:
                firsteng = 'Куплю'
                firstrus = 'куплю'
                lasteng = 'Бюджет свободный.'
                lastrus = ''
                return [firsteng, firstrus, lasteng, lastrus]   


    else:
        if choice == 1:
            firsteng = 'Продам'
            firstrus = 'продаю'
            lasteng = 'Цена договорная.'
            lastrus = ''
            return [firsteng, firstrus, lasteng, lastrus]
        else:
            firsteng = 'Куплю'
            firstrus = 'куплю'
            lasteng = 'Бюджет свободный.'
            lastrus = ''
            return [firsteng, firstrus, lasteng, lastrus]          

def ErrCounterForCode(list):
    choice = random.choice(list)
    list.remove(choice)
    if choice == 1: return random.randint(1, 255)
    elif choice == 2: return random.randint(256, 512)
    elif choice == 3: return random.randint(513, 768)
    elif choice == 4: return random.randint(769, 1024)
    elif choice == 5: return random.randint(1025, 1280)
    elif choice == 6: return random.randint(1281, 1536)
    elif choice == 7: return random.randint(1537, 1792)
    elif choice == 8: return random.randint(1973, 2048)
    elif choice == 9: return random.randint(2049, 2304)
    elif choice == 10: return random.randint(2305, 2560)
    elif choice == 11: return random.randint(2561, 2816)
    elif choice == 12: return random.randint(2817, 3072)
    elif choice == 13: return random.randint(3073, 3328)
    elif choice == 14: return random.randint(3329, 3584)
    elif choice == 15: return random.randint(3585, 3840)
    elif choice == 16: return random.randint(3841, 4096)
    elif choice == 17: return random.randint(4097, 4352)
    elif choice == 18: return random.randint(4353, 4608)
    elif choice == 19: return random.randint(1793, 1972)
    return choice

def CodeEncryptor (BeforeTime, right, ErrorPlaces):
    timezone = (time.tzname)[0] 
    if timezone == 'Финляндия (зима)': timezone = 1
    elif timezone == 'RTZ 2 (зима)': timezone = 2
    elif timezone == 'RTZ 3 (зима)': timezone = 3
    elif timezone == 'RTZ 4 (зима)': timezone = 4
    elif timezone == 'Омское стандартное время': timezone = 5
    elif timezone == 'RTZ 6 (зима)': timezone = 6
    else: timezone = 0


    Byear = BeforeTime[0]
    Bmon = BeforeTime[1]
    Bday = BeforeTime[2]
    Bhour = BeforeTime[3]
    Bmin = BeforeTime[4]
    Bsec = BeforeTime[5]

    local_time_struct = time.localtime()
    Ayear = local_time_struct.tm_year
    Amon = local_time_struct.tm_mon
    Aday = local_time_struct.tm_mday
    Ahour = local_time_struct.tm_hour
    Amin = local_time_struct.tm_min
    Asec = local_time_struct.tm_sec

    Btime = f'{Byear}.{Bmon}.{Bday}.{Bhour}.{Bmin}.{Bsec}.'
    Atime = f'{Ayear}.{Amon}.{Aday}.{Ahour}.{Amin}.{Asec}.'
    CommonPart = ''


    while True:
        if Btime == '' or Atime == '': break
        elif Btime[0] == Atime[0]:
            CommonPart += Btime[0]
            Btime = Btime[1:]
            Atime = Atime[1:]
        else: break


    Code = f"{timezone}!{CommonPart}/{Btime}-{Atime}?{right}./{ErrorPlaces}"


    Code = Code.replace('2026.', 'Z')
    Code = Code.replace('2027.', 'Y')
    Code = Code.replace('2028.', 'X')
    Code = Code.replace('2029.', 'W')
    Code = Code.replace('2030.', 'V')
    Code = Code.replace('2031.', 'U')
    Code = Code.replace('2032.', 'T')
    Code = Code.replace('2033.', 'S')
    Code = Code.replace('2034.', 'R')
    Code = Code.replace('2035.', 'Q')
    Code = Code.replace('2036.', 'P')
    Code = Code.replace('2037.', 'O')
    Code = Code.replace('2038.', 'N')
    Code = Code.replace('2039.', 'M')
    Code = Code.replace('2040.', 'L')
    Code = Code.replace('2041.', 'K')

    Code = Code.replace('0.', 'z')
    Code = Code.replace('25.', 'y')
    Code = Code.replace('24.', 'x')
    Code = Code.replace('23.', 'w')
    Code = Code.replace('22.', 'v')
    Code = Code.replace('21.', 'u')
    Code = Code.replace('20.', 't')
    Code = Code.replace('19.', 's')
    Code = Code.replace('18.', 'r')
    Code = Code.replace('17.', 'q')
    Code = Code.replace('16.', 'p')
    Code = Code.replace('15.', 'o')
    Code = Code.replace('14.', 'n')
    Code = Code.replace('13.', 'm')
    Code = Code.replace('12.', 'l')
    Code = Code.replace('11.', 'k')
    Code = Code.replace('10.', 'j')
    Code = Code.replace('9.', 'i')
    Code = Code.replace('8.', 'h')
    Code = Code.replace('7.', 'g')
    Code = Code.replace('6.', 'f')
    Code = Code.replace('5.', 'e')
    Code = Code.replace('4.', 'd')
    Code = Code.replace('3.', 'c')
    Code = Code.replace('2.', 'b')
    Code = Code.replace('1.', 'a')


    Code = Code.replace('0', 'J')
    Code = Code.replace('9', 'I')
    Code = Code.replace('8', 'H')
    Code = Code.replace('7', 'G')
    Code = Code.replace('6', 'F')
    Code = Code.replace('5', 'E')
    Code = Code.replace('4', 'D')
    Code = Code.replace('3', 'C')
    Code = Code.replace('2', 'B')
    Code = Code.replace('1', 'A')


    return Code

def CodeDecoder (Code):

    errors = ''
    
    Code = Code[::-1]
    for i in Code:
        if i != '/': 
            errors += i
            Code = Code[1:]
        else:
            Code = Code[1:] 
            break
    Code = Code[::-1]

    Code = Code.replace('Z', '2026.')
    Code = Code.replace('Y', '2027.')
    Code = Code.replace('X', '2028.')
    Code = Code.replace('W', '2029.')
    Code = Code.replace('V', '2030.')
    Code = Code.replace('U', '2031.')
    Code = Code.replace('T', '2032.')
    Code = Code.replace('S', '2033.')
    Code = Code.replace('R', '2034.')
    Code = Code.replace('Q', '2035.')
    Code = Code.replace('P', '2036.')
    Code = Code.replace('O', '2037.')
    Code = Code.replace('N', '2038.')
    Code = Code.replace('M', '2039.')
    Code = Code.replace('L', '2040.')
    Code = Code.replace('K', '2041.')

    Code = Code.replace('J', '0')
    Code = Code.replace('I', '9')
    Code = Code.replace('H', '8')
    Code = Code.replace('G', '7')
    Code = Code.replace('F', '6')
    Code = Code.replace('E', '5')
    Code = Code.replace('D', '4')
    Code = Code.replace('C', '3')
    Code = Code.replace('B', '2')
    Code = Code.replace('A', '1')

    Code = Code.replace('z', '0.')
    Code = Code.replace('y', '25.')
    Code = Code.replace('x', '24.')
    Code = Code.replace('w', '23.')
    Code = Code.replace('v', '22.')
    Code = Code.replace('u', '21.')
    Code = Code.replace('t', '20.')
    Code = Code.replace('s', '19.')
    Code = Code.replace('r', '18.')
    Code = Code.replace('q', '17.')
    Code = Code.replace('p', '16.')
    Code = Code.replace('o', '15.')
    Code = Code.replace('n', '14.')
    Code = Code.replace('m', '13.')
    Code = Code.replace('l', '12.')
    Code = Code.replace('k', '11.')
    Code = Code.replace('j', '10.')
    Code = Code.replace('i', '9.')
    Code = Code.replace('h', '8.')
    Code = Code.replace('g', '7.')
    Code = Code.replace('f', '6.')
    Code = Code.replace('e', '5.')
    Code = Code.replace('d', '4.')
    Code = Code.replace('c', '3.')
    Code = Code.replace('b', '2.')
    Code = Code.replace('a', '1.')

    Errors = errors[::-1]

    return Code, Errors

def CodeViewer (Code, Errors):
    DictForErrors = {
    'a': 'авто без тюнинга',
    'b': 'мотик (м/м)',
    'c': 'мотик (мотоцикл марки)',
    'd': 'скины',
    'e': 'неизменяемый поиск',
    'f': 'предметы',
    'g': 'чертежи',
    'h': 'отдельный тюнинг',
    'i': 'дом',
    'j': 'услуги',
    'k': 'семечки',
    'l': 'аксессуары',
    'm': 'провокации',
    'n': 'обмены',
    'o': 'авто с тюнингом',
    'p': 'сюрпризбоксы',
    'q': 'анимки',
    'r': 'набор в семьи',
    's': 'собески и реклама бизнесов',
    't': 'ресы для крафта',
    'u': 'другое',
    }
    timezone = ''
    if Code[0] == '1': timezone = 'Финляндия (зима) (MSK - 1)'
    elif Code[0] == '2': timezone = 'RTZ 2 (зима) (MSK)'
    elif Code[0] == '3': timezone = 'RTZ 3 (зима) (MSK + 1)'
    elif Code[0] == '4': timezone = 'RTZ 4 (зима) (MSK + 2)'
    elif Code[0] == '5': timezone = 'Омское стандартное время (MSK + 3)'
    elif Code[0] == '6': timezone = 'RTZ 6 (зима) (MSK + 4)'
    else: timezone = 'Неизвестно'

    Code = Code[2:]



                   
    Code = Code.replace('-', '/')
    Code = Code.replace('?', '/')
    Code = Code.split('/')
    BeforeTime = Code[0] + Code[1]
    AfterTime = Code[0] + Code[2]
    right = (Code[3])[:-1]


    AfterTime = AfterTime[:-1].split('.')
    BeforeTime = BeforeTime[:-1].split('.')

#####2026.8.14.1/5.20.7.-6.20.7.?25.

    print('Сдавалось:')
    if AfterTime[1] == '1': AfterTime[1] = 'Января'
    elif AfterTime[1] == '2': AfterTime[1] = 'Февраля'
    elif AfterTime[1] == '3': AfterTime[1] = 'Марта'
    elif AfterTime[1] == '4': AfterTime[1] = 'Апреля'
    elif AfterTime[1] == '5': AfterTime[1] = 'Мая'
    elif AfterTime[1] == '6': AfterTime[1] = 'Июня'
    elif AfterTime[1] == '7': AfterTime[1] = 'Июля'
    elif AfterTime[1] == '8': AfterTime[1] = 'Августа'
    elif AfterTime[1] == '9': AfterTime[1] = 'Сентября'
    elif AfterTime[1] == '10': AfterTime[1] = 'Октября'
    elif AfterTime[1] == '11': AfterTime[1] = 'Ноября'
    elif AfterTime[1] == '12': AfterTime[1] = 'Декабря'

    AfterTime[1], AfterTime[2] = AfterTime[2], AfterTime[1]


    if BeforeTime[1] == '1': BeforeTime[1] = 'Января'
    elif BeforeTime[1] == '2': BeforeTime[1] = 'Февраля'
    elif BeforeTime[1] == '3': BeforeTime[1] = 'Марта'
    elif BeforeTime[1] == '4': BeforeTime[1] = 'Апреля'
    elif BeforeTime[1] == '5': BeforeTime[1] = 'Мая'
    elif BeforeTime[1] == '6': BeforeTime[1] = 'Июня'
    elif BeforeTime[1] == '7': BeforeTime[1] = 'Июля'
    elif BeforeTime[1] == '8': BeforeTime[1] = 'Августа'
    elif BeforeTime[1] == '9': BeforeTime[1] = 'Сентября'
    elif BeforeTime[1] == '10': BeforeTime[1] = 'Октября'
    elif BeforeTime[1] == '11': BeforeTime[1] = 'Ноября'
    elif BeforeTime[1] == '12': BeforeTime[1] = 'Декабря'

    BeforeTime[1], BeforeTime[2] = BeforeTime[2], BeforeTime[1]

    if len(AfterTime[3]) == 1: AfterTime[3] = f'0{AfterTime[3]}'
    if len(AfterTime[5]) == 1: AfterTime[5] = f'0{AfterTime[4]}'
    if len(AfterTime[4]) == 1: AfterTime[4] = f'0{AfterTime[5]}'

    if len(BeforeTime[3]) == 1: BeforeTime[3] = f'0{BeforeTime[3]}'
    if len(BeforeTime[5]) == 1: BeforeTime[5] = f'0{BeforeTime[4]}'
    if len(BeforeTime[4]) == 1: BeforeTime[4] = f'0{BeforeTime[5]}'

    print(f'Сдавалось с {BeforeTime[0]}г, {BeforeTime[1]} {BeforeTime[2]}, {BeforeTime[3]}:{BeforeTime[4]}:{BeforeTime[5]} по локальному времени')
    print(f'         по {AfterTime[0]}г, {AfterTime[1]} {AfterTime[2]}, {AfterTime[3]}:{AfterTime[4]}:{AfterTime[5]} по локальному времени')
    print(f"Часовой пояс: {timezone}")
    print(f"Верных ответов: {right} (ошибок: {35 - int(right)})")

    print("Ошибки:")
    counter = 0
    for err in Errors:
        counter += 1
        print(f"{counter}. {DictForErrors[err]}")

    return None

while True:
    os.system('cls')
    print('By Alan_Edwards (AEZER)')
    print('V 1.0\n')
    print('Для изменения размера шрифта, вращайте колёсико мыши, зажав левый CTRL\n\n\n')
    print('Выберите режим работы программы...')
    print('0. Выйти')
    print('1. Обучение')
    print('2. Бесконечный')
    print('3. Сдача экзамена П.Р.О.')
    print('4. Расшифровать код (для принимающих экзамен)')
    ChoiceOfMode = input('Напишите цифру для выбора режима\n\n')

    if ChoiceOfMode == '0': break

    elif ChoiceOfMode == '1':
        os.system('cls')
        print('Привет!')
        time.sleep(2)
        print('Чтобы редактировать объявлений нужно скачать AHK')
        time.sleep(1)
        print('Если он у тебя ещё не скачан, то вот тебе видеоинструкция (by Jackie_Estacado)')
        time.sleep(1)
        print('https://rutube.ru/video/09b1eb8546234b219fbec9598877953d/')
        print('(Ссылка скопирована)')

        os.system(f'echo https://rutube.ru/video/09b1eb8546234b219fbec9598877953d/|clip')

        input('Чтобы продолжить, нажмите Enter\n')
        print('В видео было показано: для поиска сокращения AHK нужно открыть файл через блокнот...')
        time.sleep(1)
        print('...и ввести искомое слово или число в поле, которое появляется после нажатия CTRL + F')
        time.sleep(1)
        print('Чтобы убедиться, что AHK работает, попробуй написать .кф90 ')
        time.sleep(1)
        print('У тебя должно получиться "[Транспорт] Куплю а/м "BMW M5 F90""')
        input('Чтобы продолжить, нажмите Enter\n')
        print('Для редактирования объявлений необходимо использовать ТОЛЬКО AHK, за исключением редких случаев\n')
        time.sleep(1)
        print('Как Вы могли узнать из лекций, в конце объявления пишется либо "Бюджет свободный." (.бс ), либо " Цена договорная." (.цд)...')
        time.sleep(1)
        print('В зависимости от того, покупка это или продажа')
        time.sleep(1)
        print('В случае поиска людей, услуг, обмена пишется "Просьба связаться." (.псв )\n')
        time.sleep(1)
        print('При покупке чего либо, в начале пишется .к, потом без пробелов сразу пишется сокращение')
        time.sleep(1)
        print('При продаже всё тоже самое, но вместо .к в начале .п')
        time.sleep(1)
        print('При обмене первая часть будет начинаться с .о, вторая с .на')
        input('Чтобы продолжить, нажмите Enter\n')
        print('Для того чтобы написать тюнинг для авто, нужно написать в начале точку, а потом название тюнинга')
        time.sleep(1)
        print('Если это "Stage 1", то нужно написать .ст1')
        time.sleep(1)
        print('Также можно писать сразу несколько видов тюнинга, например .ст3ас эквивалентно "с "Stage 3", с а/с"')
        time.sleep(1)
        print('Хочу обратить внимание, что между тюнингом для авто нужно ВСЕГДА СТАВИТЬ ЗАПЯТЫЕ.')
        time.sleep(1)
        print('Также строго запрещено редактировать объявления, пропагандировающие нарушение закона и содержащие провокации')
        time.sleep(1)
        print('...Например: набор в семью "Изи рейд"')
        input('Чтобы продолжить, нажмите Enter\n')
        print('Далее тебе нужно будет сдать экзамен на знание П.Р.О.')
        time.sleep(1)
        print('Но сначала рекомендую тебе потренироваться в бесконечном режиме, там сразу показываются верные ответы...')
        print('...и ты сможешь корректировать свои ошибки')
        time.sleep(1)
        print('После сдачи эказмена тебе надо будет прислать принимающему скриншот кода и сам код сдачи')
        time.sleep(1)
        print('Удачи! ;)')
        time.sleep(2)

    elif ChoiceOfMode == '2':
        combo = 0
        counter = -1
        right = 0
        while True:
            os.system('cls')
            counter += 1
            print(f'Вы отредактировали {counter} объявлений! Из них верно: {right}')
            if combo == 0: print('У вас нет активного комбо :(')
            else: print(f'У вас комбо из {combo} верно отредактированных объявлений!')
            print('\nЧтобы удалить объявление, напишите DELETE')
            OneStep = random.randint(1, 4608)
            ###############      ПОКУПКА ИЛИ ПРОДАЖА А/М      ############### 1
            if OneStep <249 and OneStep > 0:
                RusObj, EngObj = random.choice(list(a1m.items()))
                buyorsell = SummOrBank(EngObj, Prices)
                eng = f'[Транспорт] {buyorsell[0]} а/м "{EngObj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo = combo + 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############      ПОКУПКА ИЛИ ПРОДАЖА М/М      ############### 1
            elif OneStep == 249 or OneStep == 250:
                RusObj, EngObj = random.choice(list(m1m.items()))
                buyorsell = SummOrBank(EngObj, Prices)
                eng = f'[Транспорт] {buyorsell[0]} м/м "{EngObj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {buyorsell[3]}'
        
                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')
        
                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo = combo + 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############   ПОКУПКА ИЛИ ПРОДАЖА МОТОЦИКЛА   ############### 1
            elif OneStep > 250 and OneStep < 256:
                RusObj, EngObj = random.choice(list(moto.items()))
                buyorsell = SummOrBank(EngObj, Prices)
                eng = f'[Транспорт] {buyorsell[0]} мотоцикл марки "{EngObj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {buyorsell[3]}'
                
                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')
                
                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############     ПОКУПКА ИЛИ ПРОДАЖА СКИНОВ    ############### 2
            elif OneStep > 255 and OneStep < 513 :
                Obj = random.choice(skins)
                buyorsell = SummOrBank(Obj, Prices)
                eng = f'[Разное] {buyorsell[0]} одежду пошива "{Obj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} одежду "{Obj}" {buyorsell[3]}'
                        
                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')
                        
                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue            
            ##############         НЕИЗМЕНЯЕМЫЙ ПОИСК         ############### 3
            elif OneStep > 512 and OneStep < 769:
                rus, eng = random.choice(list(UnchangeableSeeking.items()))
                            
                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')
                            
                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############   ПОКУПКА ИЛИ ПРОДАЖА ПРЕДМЕТОВ   ############### 4  
            elif OneStep > 768 and OneStep < 1025:
                RusObj, EngObj = random.choice(list(things.items()))
                buyorsell = SummOrBank(EngObj, Prices)
                eng = f'[Разное] {buyorsell[0]} предмет "{EngObj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############    ПОКУПКА ИЛИ ПРОДАЖА ЧЕРТЕЖЕЙ   ############### 5
            elif OneStep > 1024 and OneStep < 1281:
                RusObj, EngObj = random.choice(list(blueprints.items()))
                buyorsell = SummOrBank(EngObj, Prices)
                eng = f'[Разное] {buyorsell[0]} чертёж "{EngObj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############    ПОКУПКА ИЛИ ПРОДАЖА ТЮНИНГА   ################ 6
            elif OneStep > 1280 and OneStep < 1537:
                RusObj, EngObj = random.choice(list(SeparatelyTuning.items()))
                buyorsell = SummOrBank(EngObj, Prices)
                eng = f'[Разное] {buyorsell[0]} {EngObj}. {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############     ПОКУПКА ИЛИ ПРОДАЖА ДОМА    ################ 7
            elif OneStep > 1536 and OneStep < 1793:
                RusPlace, EngPlace = random.choice(list(PlacesForHouse.items()))
                buyorsell = SummOrBank('house', Prices)
                eng = f'[Недвижимость] {buyorsell[0]} дом {EngPlace}. {buyorsell[2]}'
                rus = f'{buyorsell[1]} дом {RusPlace} {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############              УСЛУГИ            ################# 8
            elif OneStep > 1972 and OneStep < 2049:
                rus, eng = random.choice(list(services.items()))

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############              СЕМКИ             ################# 9
            elif OneStep > 2048 and OneStep < 2305:
                Obj = random.choice(list(seeds))
                buyorsell = SummOrBank(Obj, Prices)
                genom = random.choice(list(genoms))
                rus = f'{buyorsell[1]} семки {Obj} с генами {genom} {buyorsell[3]}'
                eng = f'[Разное] {buyorsell[0]} семена "{Obj}" для фермы с геномом "{genom}". {buyorsell[2]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')
                inp = inp.replace('c', 'с')

                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############    ПОКУПКА ИЛИ ПРОДАЖА АКСОВ   ################# 10
            elif OneStep > 2304 and OneStep < 2561:
                Obj = random.choice(list(aks))
                buyorsell = SummOrBank(Obj, Prices)
                rus = f'{buyorsell[1]} {Obj} {buyorsell[3]}'
                eng = f'[Разное] {buyorsell[0]} аксессуар "{Obj}". {buyorsell[2]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ############### НАРКОТИКИ, УБИЙСТВА И ПРОВОКАЦИИ ############### 11
            elif OneStep > 2560 and OneStep < 2817:
                choicer = random.randint(1, 9)
                print('-------------------------------------------------------------------------------')
                if choicer == 1: print("продаю мятную пудру за 300к")
                elif choicer == 2: print("продам хасбика")
                elif choicer == 3: print("работает киллер, звонить по номеру 47 (не 67)")                       ###ПАСХАЛКА
                elif choicer == 4: print("семья 'Изи рейд' ищет дальних родственников")
                elif choicer == 5: print("gbs")      
                elif choicer == 6: print("для квеста")
                elif choicer == 7: print("передаю привет всей области")
                elif choicer == 8: print("Барсикова ищу, я одно пишу а он, редачит по другому!")         ###ПАСХАЛКА
                elif choicer == 9: print("обменяю ф90 на дом в гарели")
                print('-------------------------------------------------------------------------------')
                inp = (input("Редачь объяву!\n")).strip(' ')
                if inp != 'DELETE': 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print("                                         НЕВЕРНО! ЭТО ОБЪЯВЛЕНИЕ НУЖНО УДАЛИТЬ!")
                    combo = 0
                else: 
                    print('                                                                         ВЕРНО!')
                    right += 1
                    combo += 1
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############              ОБМЕНЫ              ############### 12
            elif OneStep > 2816 and OneStep < 3073:
                choicer = random.randint(1, 2)
                if choicer == 1:
                    RusObj, EngObj = random.choice(list(a1m.items()))
                    RusObjTwo, EngObjTwo = random.choice(list(a1m.items()))
                    eng = f'[Транспорт] Обменяю а/м "{EngObj}" на а/м "{EngObjTwo}". Просьба связаться.'
                    rus = f'обменяю {RusObj} на {RusObjTwo}'
                    print('-------------------------------------------------------------------------------')
                    print(rus)
                    print('-------------------------------------------------------------------------------')
                    inp = (input('Редачь объяву!\n')).strip(' ')

                    if inp == eng: 
                        print("                                                                         ВЕРНО!")
                        right += 1
                        combo += 1
                    else: 
                        print('///////////////////////////////////////////////////////////////////////////')
                        print(f'{eng}\n')
                        print("                                                                        НЕВЕРНО!")
                        combo = 0
                else:
                    RusObj, EngObj = random.choice(list(PlacesForHouse.items()))
                    RusObjTwo, EngObjTwo = random.choice(list(PlacesForHouse.items()))
                    eng = f'[Недвижимость] Обменяю дом {EngObj} на дом {EngObjTwo}. Просьба связаться.'
                    rus = f'обменяю дом {RusObj} на дом {RusObjTwo}'
                    print('-------------------------------------------------------------------------------')
                    print(rus)
                    print('-------------------------------------------------------------------------------')
                    inp = (input('Редачь объяву!\n')).strip(' ')

                    if inp == eng: 
                        print("                                                                         ВЕРНО!")
                        right += 1
                        combo += 1
                    else: 
                        print('///////////////////////////////////////////////////////////////////////////')
                        print(f'{eng}\n')
                        print("                                                                        НЕВЕРНО!")
                        combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ############## ПОКУПКА ИЛИ ПРОДАЖА АВТО С ТЮНИНГОМ ############# 13
            elif OneStep >3072 and OneStep < 3329:
                RusObj, EngObj = random.choice(list(a1m.items()))
                TuneRus, TuneEng = random.choice(list(TuningForAuto.items()))
                buyorsell = SummOrBank(EngObj, Prices, TuneEng)
                eng = f'[Транспорт] {buyorsell[0]} а/м "{EngObj}" {TuneEng}. {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {TuneRus} {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            #############      ПОКУПКА ИЛИ ПРОДАЖА КЕЙСОВ      ############# 14
            elif OneStep > 3328 and OneStep < 3585 :
                Obj = random.choice(Boxes)
                buyorsell = SummOrBank(Obj, Prices)
                eng = f'[Разное] {buyorsell[0]} сюрпризбокс "{Obj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} кейс "{Obj}" {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            #############      ПОКУПКА ИЛИ ПРОДАЖА АНИМОК      ############# 15
            elif OneStep > 3584 and OneStep < 3841 :
                Obj = random.choice(Anims)
                buyorsell = SummOrBank(Obj, Prices)

                BuyOrSellAnim = ''
                if buyorsell[0] == 'Продам': BuyOrSellAnim = 'Обучу'
                else: BuyOrSellAnim = 'Обучусь'

                eng = f'[Разное] {BuyOrSellAnim} движению "{Obj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} урок по движению "{Obj}" {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ############            НАБОР В СЕМЬИ              ############# 16 
            elif OneStep > 3840 and OneStep < 4097:
                rus, eng = random.choice(list(families.items()))

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')
        
                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ############       СОБЕСКИ И РЕКЛАМА БИЗНЕСОВ       ############ 17
            elif OneStep > 4096 and OneStep < 4353:
                rus, eng = random.choice(list(interviews.items()))

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ############  ПОКУПКА ИЛИ ПРОДАЖА РЕСОВ ДЛЯ КРАФТА  ############ 18
            elif OneStep > 4352 and OneStep < 4609 :
                Obj = random.choice(Resources)
                buyorsell = SummOrBank(Obj, Prices)
                eng = f'[Разное] {buyorsell[0]} предмет для переработки "{Obj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} ресурс "{Obj}" {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###########  ПОКУПКА ИЛИ ПРОДАЖА ОСТАВШЕГОСЯ ШЛАКА  ############ 19
            elif OneStep > 1792 and OneStep < 1973 :
                RusObj, EngObj = random.choice(list(other.items()))
                buyorsell = SummOrBank(EngObj, Prices)
                eng = f'[Разное] {buyorsell[0]} {EngObj}. {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: 
                    print("                                                                         ВЕРНО!")
                    right += 1
                    combo += 1
                else: 
                    print('///////////////////////////////////////////////////////////////////////////')
                    print(f'{eng}\n')
                    print("                                                                        НЕВЕРНО!")
                    combo = 0
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue 

    elif ChoiceOfMode == '3':
        ListForQuestions = [1, 1, 1, 2, 2, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 9, 10, 10, 11, 11, 12, 12, 13, 13, 13, 14, 14, 15, 15, 16, 16, 17, 18, 18, 19, 19]
        counter = 0
        right = 0

        ErrorPlaces = ''

        print("Вы начали сдавать эказмен на знание П.Р.О., будьте внимательны и допускайте минимум ошибок.")

        time.sleep(0.5)
        print('Экзамен начался!!!')
        time.sleep(0.5)
        print('Экзамен начался!!!')
        time.sleep(0.5)
        print('Экзамен начался!!!')
        time.sleep(0.5)


        local_time_struct = time.localtime()

        year = local_time_struct.tm_year
        mon = local_time_struct.tm_mon
        day = local_time_struct.tm_mday
        hour = local_time_struct.tm_hour
        min = local_time_struct.tm_min
        sec = local_time_struct.tm_sec

        BeforeTime = [year, mon, day, hour, min, sec]

        while True:
            os.system('cls')
            if counter > 34: break
            counter += 1
            print(f'Это {counter} вопрос из 35!')
            print('\nЧтобы удалить объявление, напишите DELETE')
            OneStep = ErrCounterForCode(ListForQuestions)
            ###############      ПОКУПКА ИЛИ ПРОДАЖА А/М      ###############
            if OneStep <249 and OneStep > 0:
                RusObj, EngObj = random.choice(list(a1m.items()))
                buyorsell = SummOrBank(EngObj, Prices)
                eng = f'[Транспорт] {buyorsell[0]} а/м "{EngObj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: right += 1
                else: ErrorPlaces += 'a'

                print('                                                                         ПРИНЯТО')

                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############      ПОКУПКА ИЛИ ПРОДАЖА М/М      ###############
            elif OneStep == 249 or OneStep == 250:
                RusObj, EngObj = random.choice(list(m1m.items()))
                buyorsell = SummOrBank(EngObj, Prices)
                eng = f'[Транспорт] {buyorsell[0]} м/м "{EngObj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {buyorsell[3]}'
        
                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')
        
                if inp == eng: right += 1
                else: ErrorPlaces += 'b'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############   ПОКУПКА ИЛИ ПРОДАЖА МОТОЦИКЛА   ###############
            elif OneStep > 250 and OneStep < 256:
                RusObj, EngObj = random.choice(list(moto.items()))
                buyorsell = SummOrBank(EngObj, Prices)
                eng = f'[Транспорт] {buyorsell[0]} мотоцикл марки "{EngObj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {buyorsell[3]}'
                
                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')
                
                if inp == eng: right += 1
                else: ErrorPlaces += 'с'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############     ПОКУПКА ИЛИ ПРОДАЖА СКИНОВ    ###############
            elif OneStep > 255 and OneStep < 513 :
                Obj = random.choice(skins)
                buyorsell = SummOrBank(Obj, Prices)
                eng = f'[Разное] {buyorsell[0]} одежду пошива "{Obj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} одежду "{Obj}" {buyorsell[3]}'
                        
                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')
                        
                if inp == eng: right += 1
                else: ErrorPlaces += 'd'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue            
            ##############         НЕИЗМЕНЯЕМЫЙ ПОИСК         ###############
            elif OneStep > 512 and OneStep < 769:
                rus, eng = random.choice(list(UnchangeableSeeking.items()))
                            
                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')
                            
                if inp == eng: right += 1
                else: ErrorPlaces += 'e'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############   ПОКУПКА ИЛИ ПРОДАЖА ПРЕДМЕТОВ   ###############    
            elif OneStep > 768 and OneStep < 1025:
                RusObj, EngObj = random.choice(list(things.items()))
                buyorsell = SummOrBank(EngObj, Prices)
                eng = f'[Разное] {buyorsell[0]} предмет "{EngObj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: right += 1
                else: ErrorPlaces += 'f'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############    ПОКУПКА ИЛИ ПРОДАЖА ЧЕРТЕЖЕЙ   ############### 
            elif OneStep > 1024 and OneStep < 1281:
                RusObj, EngObj = random.choice(list(blueprints.items()))
                buyorsell = SummOrBank(EngObj, Prices)
                eng = f'[Разное] {buyorsell[0]} чертёж "{EngObj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: right += 1
                else: ErrorPlaces += 'g'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############    ПОКУПКА ИЛИ ПРОДАЖА ТЮНИНГА   ################ 
            elif OneStep > 1280 and OneStep < 1537:
                RusObj, EngObj = random.choice(list(SeparatelyTuning.items()))
                buyorsell = SummOrBank(EngObj, Prices)
                eng = f'[Разное] {buyorsell[0]} {EngObj}. {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: right += 1
                else: ErrorPlaces += 'h'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############     ПОКУПКА ИЛИ ПРОДАЖА ДОМА    ################ 
            elif OneStep > 1536 and OneStep < 1793:
                RusPlace, EngPlace = random.choice(list(PlacesForHouse.items()))
                buyorsell = SummOrBank('house', Prices)
                eng = f'[Недвижимость] {buyorsell[0]} дом {EngPlace}. {buyorsell[2]}'
                rus = f'{buyorsell[1]} дом {RusPlace} {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: right += 1
                else: ErrorPlaces += 'i'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############              УСЛУГИ            ################# 
            elif OneStep > 1972 and OneStep < 2049:
                rus, eng = random.choice(list(services.items()))

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: right += 1
                else: ErrorPlaces += 'j'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############              СЕМКИ             ################# 
            elif OneStep > 2048 and OneStep < 2305:
                Obj = random.choice(list(seeds))
                buyorsell = SummOrBank(Obj, Prices)
                genom = random.choice(list(genoms))
                rus = f'{buyorsell[1]} семки {Obj} с генами {genom} {buyorsell[3]}'
                eng = f'[Разное] {buyorsell[0]} семена "{Obj}" для фермы с геномом "{genom}". {buyorsell[2]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')
                inp = inp.replace('c', 'с')

                if inp == eng: right += 1
                else: ErrorPlaces += 'k'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############    ПОКУПКА ИЛИ ПРОДАЖА АКСОВ   ################# 
            elif OneStep > 2304 and OneStep < 2561:
                Obj = random.choice(list(aks))
                buyorsell = SummOrBank(Obj, Prices)
                rus = f'{buyorsell[1]} {Obj} {buyorsell[3]}'
                eng = f'[Разное] {buyorsell[0]} аксессуар "{Obj}". {buyorsell[2]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: right += 1
                else: ErrorPlaces += 'l'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ############### НАРКОТИКИ, УБИЙСТВА И ПРОВОКАЦИИ ###############
            elif OneStep > 2560 and OneStep < 2817:
                choicer = random.randint(1, 9)
                print('-------------------------------------------------------------------------------')
                if choicer == 1: print("продаю мятную пудру за 300к")
                elif choicer == 2: print("продам хасбика")
                elif choicer == 3: print("работает киллер, звонить по номеру 47 (не 67)")                       ###ПАСХАЛКА
                elif choicer == 4: print("семья 'Изи рейд' ищет дальних родственников")
                elif choicer == 5: print("ПЕНИС ПЕНИС ПЕНИС")      
                elif choicer == 6: print("для квеста")
                elif choicer == 7: print("передаю привет всей области")
                elif choicer == 8: print("Барсикова ищу, я одно пишу а он редачит фиг пойми как, петушок!")         ###ПАСХАЛКА
                elif choicer == 9: print("обменяю ф90 на дом в гарели")
                print('-------------------------------------------------------------------------------')
                inp = (input("Редачь объяву!\n")).strip(' ')
                if inp == 'DELETE': right += 1
                else: ErrorPlaces += 'm'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###############              ОБМЕНЫ              ###############
            elif OneStep > 2816 and OneStep < 3073:
                choicer = random.randint(1, 2)
                if choicer == 1:
                    RusObj, EngObj = random.choice(list(a1m.items()))
                    RusObjTwo, EngObjTwo = random.choice(list(a1m.items()))
                    eng = f'[Транспорт] Обменяю а/м "{EngObj}" на а/м "{EngObjTwo}". Просьба связаться.'
                    rus = f'обменяю {RusObj} на {RusObjTwo}'
                    print('-------------------------------------------------------------------------------')
                    print(rus)
                    print('-------------------------------------------------------------------------------')
                    inp = (input('Редачь объяву!\n')).strip(' ')

                    if inp == eng: right += 1
                    else: ErrorPlaces += 'n'

                    print('                                                                         ПРИНЯТО')
                else:
                    RusObj, EngObj = random.choice(list(PlacesForHouse.items()))
                    RusObjTwo, EngObjTwo = random.choice(list(PlacesForHouse.items()))
                    eng = f'[Недвижимость] Обменяю дом {EngObj} на дом {EngObjTwo}. Просьба связаться.'
                    rus = f'обменяю дом {RusObj} на дом {RusObjTwo}'
                    print('-------------------------------------------------------------------------------')
                    print(rus)
                    print('-------------------------------------------------------------------------------')
                    inp = (input('Редачь объяву!\n')).strip(' ')

                    if inp == eng: right += 1
                    else: ErrorPlaces += 'n'

                    print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ############## ПОКУПКА ИЛИ ПРОДАЖА АВТО С ТЮНИНГОМ #############
            elif OneStep > 3072 and OneStep < 3329:
                RusObj, EngObj = random.choice(list(a1m.items()))
                TuneRus, TuneEng = random.choice(list(TuningForAuto.items()))
                buyorsell = SummOrBank(EngObj, Prices, TuneEng)
                eng = f'[Транспорт] {buyorsell[0]} а/м "{EngObj}" {TuneEng}. {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {TuneRus} {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: right += 1
                else: ErrorPlaces += 'o'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            #############      ПОКУПКА ИЛИ ПРОДАЖА КЕЙСОВ      #############
            elif OneStep > 3328 and OneStep < 3585 :
                Obj = random.choice(Boxes)
                buyorsell = SummOrBank(Obj, Prices)
                eng = f'[Разное] {buyorsell[0]} сюрпризбокс "{Obj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} кейс "{Obj}" {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: right += 1
                else: ErrorPlaces += 'p'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            #############      ПОКУПКА ИЛИ ПРОДАЖА АНИМОК      #############
            elif OneStep > 3584 and OneStep < 3841 :
                Obj = random.choice(Anims)
                buyorsell = SummOrBank(Obj, Prices)

                BuyOrSellAnim = ''
                if buyorsell[0] == 'Продам': BuyOrSellAnim = 'Обучу'
                else: BuyOrSellAnim = 'Обучусь'

                eng = f'[Разное] {BuyOrSellAnim} движению "{Obj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} урок по движению "{Obj}" {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: right += 1
                else: ErrorPlaces += 'q'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ############            НАБОР В СЕМЬИ              #############    
            elif OneStep > 3840 and OneStep < 4097:
                rus, eng = random.choice(list(families.items()))

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')
        
                if inp == eng: right += 1
                else: ErrorPlaces += 'r'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ############       СОБЕСКИ И РЕКЛАМА БИЗНЕСОВ       ############ 
            elif OneStep > 4096 and OneStep < 4353:
                rus, eng = random.choice(list(interviews.items()))

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: right += 1
                else: ErrorPlaces += 's'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ############  ПОКУПКА ИЛИ ПРОДАЖА РЕСОВ ДЛЯ КРАФТА  ############
            elif OneStep > 4352 and OneStep < 4609 :
                Obj = random.choice(Resources)
                buyorsell = SummOrBank(Obj, Prices)
                eng = f'[Разное] {buyorsell[0]} предмет для переработки "{Obj}". {buyorsell[2]}'
                rus = f'{buyorsell[1]} ресурс "{Obj}" {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: right += 1
                else: ErrorPlaces += 't'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue
            ###########  ПОКУПКА ИЛИ ПРОДАЖА ОСТАВШЕГОСЯ ШЛАКА  ############
            elif OneStep > 1792 and OneStep < 1973 :
                RusObj, EngObj = random.choice(list(other.items()))
                buyorsell = SummOrBank(EngObj, Prices)
                eng = f'[Разное] {buyorsell[0]} {EngObj}. {buyorsell[2]}'
                rus = f'{buyorsell[1]} {RusObj} {buyorsell[3]}'

                print('-------------------------------------------------------------------------------')
                print(rus)
                print('-------------------------------------------------------------------------------')
                inp = (input('Редачь объяву!\n')).strip(' ')

                if inp == eng: right += 1
                else: ErrorPlaces += 'u'

                print('                                                                         ПРИНЯТО')
                cont = input('Нажмите Enter, чтобы продолжить. Напишите Exit, чтобы выйти')
                if cont == 'Exit': break
                else: continue 

        ### Генерация и отправка кода
        Code = CodeEncryptor(BeforeTime, right, ErrorPlaces)
        while True:
            os.system('cls')
            print(f' Код: {Code}')

            os.system(f'echo {Code}|clip')

            time.sleep(0.5)
            print('Сделайте скриншот программы в этот момент (Windows + Shift + S), и отправьте его принимающему.')
            print('Отправьте код вместе со скриншотом (Код уже скопирован, CTRL + V, чтобы вставить.)\n')
            time.sleep(0.5)
            continuer = input('Напишите "Exit", чтобы выйти\n')
            if continuer == 'Exit': break
            else: continue
        
    elif ChoiceOfMode == '4':
        os.system('cls')
        print('Вы вошли в режим расшифровки кода сдачи экзамена')
        password = input('Введите пароль\n')
        PassHash = (hashlib.sha256(password.encode())).hexdigest()
        Hash = 'c42f9b6b6b148a465783a99e30bbcdee5a70450a297d8aa84f827e8c691d5a9b'
        for i in range(100):
            print(f'Счет: {i}%', end='\r', flush=True)
            time.sleep(0.05) 
        if Hash == PassHash: 
            print("Верно!")
            time.sleep(1)
            os.system('cls')

            Code = input('Введите код, который хотите расшифровать\n\n')

            CodeToViev, Errors = CodeDecoder(Code)
            CodeViewer(CodeToViev, Errors)

            input('Enter, чтобы продолжить')
        else: 
            print('Код неверный!')
            input('Enter, чтобы продолжить')
